[
    {
        "date": "2024-07-15",
        "event": "Convention lineup showcases future of G.O.P.: By Adam Nagourney",
        "impact_score": 9.999521940339138,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-29",
        "event": "Philadelphia DA sues Elon Musk over controversial $1 million voter giveaway: The Philadelphia district attorney sued Elon Musk and his super PAC on Monday over the billionaire's controversial $1 million giveaway.",
        "impact_score": 9.998965165665412,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-05",
        "event": "Loyal Democratic Voters React to Biden Interview With Relief, and Despair: “I tell you, he looked a whole lot better than the debate,” said one voter in Detroit.",
        "impact_score": 9.998633753752662,
        "impact_on": "Biden"
    },
    {
        "date": "2024-08-22",
        "event": "Tim Walz, Oprah and Bill Clinton deliver the biggest moments on day three of the Democratic National Convention: With Oprah sneaking in for a surprise address and Bill Clinton returning to the spotlight, Tim Walz enjoyed a star-studded opening act before he made his debut. This is what you missed on day three of the Democratic convention.",
        "impact_score": 9.997405889573036,
        "impact_on": "Harris"
    },
    {
        "date": "2024-04-26",
        "event": "Biden says he's ready for election debate with Trump: US President says he is \"happy\" to face rival who claims he is ready \"anytime, anywhere, anyplace\".",
        "impact_score": 9.996604928025482,
        "impact_on": "Biden"
    },
    {
        "date": "2024-01-03",
        "event": "It 2024, and the Candidates Are Campaigning at a Furious Pace: The Iowa caucuses are less than two weeks away. The candidates challenging Donald J. Trump hope a strong showing will lead to consolidated support.",
        "impact_score": 9.995110211803386,
        "impact_on": "Trump"
    },
    {
        "date": "2024-02-18",
        "event": "For Harris, Promises to Ukraine Prove Harder to Make Amid G.O.P. Resistance: Vice President Kamala Harris tried to reassure European and Ukrainian leaders that America would come through with security aid. But worries persist as House Republican leaders block the measure.; Vice President Kamala Harris tried to reassure European and Ukrainian leaders that America would come through with security aid. But worries persist as House Republican leaders block the measure.",
        "impact_score": 9.993573501773705,
        "impact_on": "Biden"
    },
    {
        "date": "2024-11-01",
        "event": "Asian American voters could be key swing voters: By Amy Qin; By Amy Qin",
        "impact_score": 9.99243213396541,
        "impact_on": "Trump"
    },
    {
        "date": "2024-09-06",
        "event": "Judge to decide Friday whether to delay Trump's sentencing in hush money case: The New York judge overseeing former President Trump's hush money case will decide Friday whether to delay his Sept. 18 sentencing, according to a court filing Thursday.",
        "impact_score": 9.991864717821391,
        "impact_on": "Trump"
    },
    {
        "date": "2024-08-28",
        "event": "FBI Trump gunman's motive still a mystery as new photos released: Authorities said that Thomas Crooks - the shooter - appears to have viewed the Trump rally as a \"target of opportunity\".",
        "impact_score": 9.991226995219781,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-26",
        "event": "In three-hour Rogan interview, Trump reveals 'biggest mistake': Trump also discusses life in space, his rival Kamala Harris, and how he urged North Korea's leader to \"relax\".",
        "impact_score": 9.990860783696013,
        "impact_on": "Trump"
    },
    {
        "date": "2024-09-05",
        "event": "First hearing in Trump election interference case since immunity ruling: A federal judge is holding a hearing in Washington, DC, to consider how to proceed with special counsel Jack Smith’s election interference case against Donald Trump. Follow for live news updates.",
        "impact_score": 9.990815702558631,
        "impact_on": "Harris"
    },
    {
        "date": "2024-09-30",
        "event": "Man charged in Trump assassination plot pleads not guilty: Prosecutors say Ryan Routh was spotted with a rifle as he hid in the bushes near Trump’s golf course in Florida.",
        "impact_score": 9.989977880922428,
        "impact_on": "Trump"
    },
    {
        "date": "2024-05-22",
        "event": "Georgia DA and judge in Trump election interference case beat primary challengers: The Associated Press projects Fulton County District Attorney Fani Willis will win her primary.",
        "impact_score": 9.989632976157665,
        "impact_on": "Harris"
    },
    {
        "date": "2024-01-05",
        "event": "Trump appeals Colorado 14th Amendment election disqualification to US Supreme Court: Colorado's Supreme Court had barred him from the state's GOP primary ballot.",
        "impact_score": 9.98951471123136,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-16",
        "event": "Resurgent Trump Has Democrats in Swing Districts Despondent: The Democratic plan to hustle through President Biden’s nomination has angered some in the party looking for a change on the ticket, as Republicans project confidence in a drubbing.",
        "impact_score": 9.989280131825206,
        "impact_on": "Harris"
    },
    {
        "date": "2024-11-02",
        "event": "Trump's Microphone Trouble in Milwaukee Leaves Him Seething 2019: After rally goers complained that they could not hear him, the former president asked, “Do you want to see me knock the hell out of people backstage?”; After rally goers complained that they could not hear him, the former president asked, “Do you want to see me knock the hell out of people backstage?”",
        "impact_score": 9.98858225937676,
        "impact_on": "Trump"
    },
    {
        "date": "2024-02-23",
        "event": "Trump Says He Supports I.V.F. and Calls for Treatment to Remain Legal: The Alabama Supreme Court ruling highlighted divisions in the Republican Party between staunch abortion opponents who say life begins at conception and those who want to protect in vitro fertilization treatments.; The Alabama Supreme Court ruling highlighted divisions in the Republican Party between staunch abortion opponents who say life begins at conception and those who want to protect in vitro fertilization treatments.",
        "impact_score": 9.985630280060613,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-31",
        "event": "How the roads not taken have shaped the 2024 race for the White House: Critical decisions made by the Trump and Harris campaigns this summer and fall, and key moments as the race progressed, could decide the election’s outcome.",
        "impact_score": 9.984675643159497,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-12",
        "event": "Kamala Harris's doctor reports she's in 'excellent health', as her campaign looks to draw a contrast with Donald Trump: Dr Joshua Simmons, a US Army colonel and physician to the vice-president, wrote that Ms Harris, 59, maintains a healthy, active lifestyle and that she \"possesses the physical and mental resiliency\" required to serve as president.",
        "impact_score": 9.982552446946446,
        "impact_on": "Harris"
    },
    {
        "date": "2024-03-05",
        "event": "The Biggest Issue on Americans' Minds Is Also a Tough One to Agree On: As 15 states hold primaries on Super Tuesday, we asked voters what they would do about immigration and how it was affecting their decisions.",
        "impact_score": 9.978132760453711,
        "impact_on": "Harris"
    },
    {
        "date": "2024-01-14",
        "event": "Atlanta D.A. Defends Qualifications of Outside Lawyer She Hired for Trump Case: At a historic Black church, Fani T. Willis pushed back against an accusation that Nathan Wade, the special prosecutor she brought on, was unqualified for the job.; At a historic Black church, Fani T. Willis pushed back against an accusation that Nathan Wade, the special prosecutor she brought on, was unqualified for the job.",
        "impact_score": 9.977717030424635,
        "impact_on": "Trump"
    },
    {
        "date": "2024-08-12",
        "event": "Chairman of Trump Shooting Inquiry Brings Personal Experience to the Task: Representative Mike Kelly of Pennsylvania was in the audience with family, including three of his grandchildren, during the shooting.; Representative Mike Kelly of Pennsylvania was in the audience with family, including three of his grandchildren, during the shooting.",
        "impact_score": 9.977273599365226,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-24",
        "event": "Trump's 2024 Convention Speech Had More Falsehoods Than His 2016 One: A comparison of former President Donald:Trump’s addresses before the Republican National Convention in 2016 and 2024 demonstrates how his relationship to the truth has changed.; A comparison of former President Donald J. Trump’s addresses before the Republican National Convention in 2016 and 2024 demonstrates how his relationship to the truth has changed.",
        "impact_score": 9.977160244008525,
        "impact_on": "Trump"
    },
    {
        "date": "2024-05-21",
        "event": "Here's Why Republicans Are Focusing on Voting by Noncitizens: House Republicans are pushing legislation to crack down on voting by noncitizens, which is allowed in some local elections but illegal — and exceedingly rare — at the federal level.; House Republicans are pushing legislation to crack down on voting by noncitizens, which is allowed in some local elections but illegal — and exceedingly rare — at the federal level.",
        "impact_score": 9.977133228457191,
        "impact_on": "Harris"
    },
    {
        "date": "2024-07-22",
        "event": "Democrats Will Select Nominee by Aug. 7 in an Online Vote: The party, which has rapidly consolidated behind Vice President Kamala Harris to replace President Biden, did not set an exact date for the vote.; The party, which has rapidly consolidated behind Vice President Kamala Harris to replace President Biden, did not set an exact date for the vote.",
        "impact_score": 9.97313428787859,
        "impact_on": "Harris"
    },
    {
        "date": "2024-02-03",
        "event": "As Harris bolsters Biden in 2024, she lays the groundwork for 2028.: By Reid J. Epstein and Maya King",
        "impact_score": 9.965499910505798,
        "impact_on": "Harris"
    },
    {
        "date": "2024-11-05",
        "event": "Trump campaign doubles down in final hours of election dash: Former President Donald Trump and vice presidential pick Sen. JD Vance spent the closing hours of the 2024 race underscoring divisive campaign rhetoric.",
        "impact_score": 9.96523775139864,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-15",
        "event": "Project 2025 plan to empower Trump prompts fears for the future of US democracy: Trump's march to re-take the White House continues with renewed determination. If he wins he'll have an \"army\" of 10,000 recruits at his disposal to help implement his controversial agenda.",
        "impact_score": 9.963160058794143,
        "impact_on": "Trump"
    },
    {
        "date": "2024-01-10",
        "event": "After years of ups and downs, Trump is once again live on Fox News.: By Michael M. Grynbaum; By Michael M. Grynbaum",
        "impact_score": 9.962287182105028,
        "impact_on": "Trump"
    },
    {
        "date": "2024-08-16",
        "event": "Trump called Kamala Harris a communist. Pollster explains how those comments are landing with voters: CNN’s Phil Mattingly talks to pollster and communication strategist Frank Luntz about how voters are reacting to Donald Trump’s attacks on Kamala Harris.",
        "impact_score": 9.960266372184554,
        "impact_on": "Trump"
    },
    {
        "date": "2024-09-20",
        "event": "Supreme Court declines request to put Jill Stein on Nevada 2019s presidential ballot: The Supreme Court on Friday declined a request from the Green Party to ensure presidential candidate Jill Stein could appear on the ballot in the battleground state of Nevada.",
        "impact_score": 9.957980638572437,
        "impact_on": "Harris"
    },
    {
        "date": "2024-05-24",
        "event": "Idaho 2024 Democratic caucus results President Biden projected to win: Idaho Democrats are holding their presidential caucuses on Thursday",
        "impact_score": 9.956325290563958,
        "impact_on": "Biden"
    },
    {
        "date": "2024-07-09",
        "event": "Trump Leads Biden by 5 Percentage Points in Post-Debate Wisconsin Poll: The president’s weakness with younger voters is evident in the survey, as is former President Donald J. Trump’s benefiting from positive views of his White House term.",
        "impact_score": 9.954270615243034,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-07",
        "event": "Democrats weigh risks and rewards of losing Biden: Concern over Mr Biden's re-election effort has reached fever pitch as some lawmakers express doubts.",
        "impact_score": 9.95167275012183,
        "impact_on": "Biden"
    },
    {
        "date": "2024-10-30",
        "event": "African asylum seekers afraid ahead of US election: Thousands of asylum applicants are wondering what impact the outcome could have on their lives.",
        "impact_score": 9.951146104667412,
        "impact_on": "Trump"
    },
    {
        "date": "2024-11-07",
        "event": "Donald Trump is the first convicted felon to be president of the United States and his re-election could thwart further criminal cases against him: Donald Trump was facing a raft of legal battles before he was elected US president for a second time. Here's where each case stands and what his victory will likely mean for them.",
        "impact_score": 9.950588005544425,
        "impact_on": "Trump"
    },
    {
        "date": "2024-09-24",
        "event": "Harris's Georgia challenge: reassembling Biden's diverse 2020 coalition: Step into the Rebel Teahouse and look to the right: a stack of Kamala Harris campaign brochures on the shelf gives away a big change here.",
        "impact_score": 9.94857897885916,
        "impact_on": "Harris"
    },
    {
        "date": "2024-01-10",
        "event": "Trump turns ire on Haley as she builds momentum: With just days until the Iowa caucuses, former President Donald Trump and his team have shifted to targeting GOP presidential rival Nikki Haley as they seek to slow her recent momentum before the first votes are cast this primary season.",
        "impact_score": 9.946353249426874,
        "impact_on": "Trump"
    },
    {
        "date": "2024-09-10",
        "event": "What time is the Harris v Trump presidential debate? Everything to know: The two candidates will go head-to-head in Philadelphia. Here are the rules, moderators and what's at stake.",
        "impact_score": 9.943615929731198,
        "impact_on": "Harris"
    },
    {
        "date": "2024-07-09",
        "event": "Trump's VP announcement will come by next Monday: Adviser: Former President Donald Trump's long-awaited announcement on who his vice presidential pick will be could happen this week, senior adviser Jason Miller said on Monday.",
        "impact_score": 9.941481065791454,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-21",
        "event": "Harris Sets Record for Biggest Fund-Raising Quarter Ever: Donald Trump is raising less money than he did during his run in 2020, building a far smaller campaign than Kamala Harris.",
        "impact_score": 9.939938077987087,
        "impact_on": "Harris"
    },
    {
        "date": "2024-10-25",
        "event": "Democrats sweat Harris' polls, but strategists say election is 'jump ball': ANALYSIS: Operatives from each side see both paths to victory and potential pitfalls.",
        "impact_score": 9.937060662617636,
        "impact_on": "Harris"
    },
    {
        "date": "2024-03-15",
        "event": "Speaker Johnson urges GOP conference to 'stand together' as party defends razor-thin majority: House Speaker Mike Johnson said Thursday that his message to the GOP conference is to \"stick together\" and \"get the job done\" to expand the House majority.",
        "impact_score": 9.934234550714885,
        "impact_on": "Trump"
    },
    {
        "date": "2024-06-22",
        "event": "RNC laser-focused on vote monitoring, committed to enlisting 100,000 poll volunteers: Chair Michael Whatley led a \"poll watcher training\" on Friday on Long Island.",
        "impact_score": 9.922584655016598,
        "impact_on": "Trump"
    },
    {
        "date": "2024-06-27",
        "event": "8 things to watch for in CNN's 2024 debate between Biden and Trump: President Joe Biden and his predecessor, Donald Trump, are set to make history on CNN Thursday night as they meet for their first 2024 debate.",
        "impact_score": 9.922584655016598,
        "impact_on": "Biden"
    },
    {
        "date": "2024-06-28",
        "event": "Trump relishes a winning streak on the debate stage and in the courts: Donald Trump used to tell his fans that he'd win so much, they'd get tired of winning.",
        "impact_score": 9.922584655016598,
        "impact_on": "Trump"
    },
    {
        "date": "2024-07-15",
        "event": "How the assassination attempt on Trump unfolded: Former President Donald Trump is shown covered by US Secret Service agents after a shooting during a rally on July 13, 2024, in Butler, Pennsylvania. ",
        "impact_score": 9.922584655016598,
        "impact_on": "Trump"
    },
    {
        "date": "2024-10-29",
        "event": "CNN Polls Harris has a narrow edge in Michigan and Wisconsin, while she and Trump remain tied in Pennsylvania: Vice President Kamala Harris maintains a narrow advantage in two of the three “blue wall” states that collectively represent her clearest path to an Electoral College victory over former President Donald Trump, according to new CNN polls conducted by SSRS.",
        "impact_score": 9.922584655016598,
        "impact_on": "Harris"
    }
]