[
    {
        "title": "Trump given free rein to criticise jury, witnesses before sentencing for hush money conviction",
        "date": "Wed 26 Jun",
        "summary": "A judge has changed a ruling that stopped Donald Trump from unleashing on witnesses and jurors in his hush money trial.",
        "url": "https://www.abc.net.au/news/2024-06-26/donald-trump-can-again-comment-on-hush-money-jurors-witnesses/104022684"
    },
    {
        "title": "RFK Jr's presidential bid is shaking up an unpopular rematch — but will he ultimately help Joe Biden or Donald Trump?",
        "date": "Tue 25 Jun",
        "summary": "It can be hard to get a handle on Robert F Kennedy Jr, the nephew of JFK, but one thing's for sure: his bid for the White House can't be easily dismissed.",
        "url": "https://www.abc.net.au/news/2024-06-26/third-party-candidate-rfk-jr-us-presidential-election-race/104010442"
    },
    {
        "title": "Joe Biden and Donald Trump get personal in 'game-changing' debate ahead of 2024 election — as it happened",
        "date": "Thu 27 Jun",
        "summary": "US President Joe Biden and former president Donald Trump conclude their debate in Atlanta, Georgia — and pundits are united in their view that it was a bad night for the president. Take a look back at how the debate unfolded.",
        "url": "https://www.abc.net.au/news/2024-06-28/us-presidential-debate-joe-biden-donald-trump-atlanta-cnn/104029404"
    },
    {
        "title": "Democrats question Biden's candidacy after 'disaster' debate performance",
        "date": "Fri 28 Jun",
        "summary": "Joe Biden's poor debate performance has resulted in cries from within his party to replace him as a candidate in the United States presidential election.",
        "url": "https://www.abc.net.au/news/2024-06-28/democrats-question-biden-candidacy-presidential-debate/104036928"
    },
    {
        "title": "Key takeaways from the US presidential debate between Joe Biden and Donald Trump",
        "date": "Fri 28 Jun",
        "summary": "The historic debate between the two US presidential hopefuls was full of jabs and incoherent speech. Here are the key takeaways.",
        "url": "https://www.abc.net.au/news/2024-06-28/joe-biden-donald-trump-us-presidential-debate-key-takeaways/104034546"
    },
    {
        "title": "The first Biden vs Trump presidential debate of 2024: Where to watch and what to expect",
        "date": "Thu 27 Jun",
        "summary": "US President Joe Biden and former president Donald Trump will meet on a debate stage for the first of two televised face-offs that could prove critical in their tight rematch race to win the White House in November. Here's what to know ahead of the debate.",
        "url": "https://www.abc.net.au/news/2024-06-28/biden-vs-trump-cnn-presidential-debate-where-to-watch/104032090"
    },
    {
        "title": "Beyond Biden and Trump, American politicians are amongst the oldest in the world. Is that good for democracy?",
        "date": "Fri 28 Jun",
        "summary": "In the lead-up to the US election, many are concerned that Biden and Trump, the two oldest people to ever run for office in the US, are running again. It's indicative of a broader issue — the average age of the US Congress has been climbing for decades.",
        "url": "https://www.abc.net.au/news/2024-06-29/biden-trump-debate-us-election-how-old-is-too-old-president/103789596"
    },
    {
        "title": "Supreme Court raises bar for obstruction charges against Donald Trump and January 6 rioters",
        "date": "Fri 28 Jun",
        "summary": "The US Supreme Court has raised the legal bar for prosecutors pursuing obstruction charges in the federal election subversion case against Donald Trump and defendants involved in the January 6, 2021, attack on the Capitol.",
        "url": "https://www.abc.net.au/news/2024-06-29/supreme-court-raises-bar-for-obstruction-charge-against-trump-/104039400"
    },
    {
        "title": "Joe Biden vows to 'get back up' after damaging US presidential debate against Donald Trump",
        "date": "Fri 28 Jun",
        "summary": "Joe Biden has attempted to reassure supporters after his damaging debate performance, conceding he doesn't speak as well as he used to, but insisting he can still competently serve.",
        "url": "https://www.abc.net.au/news/2024-06-29/joe-biden-donald-trump-debate-performance-us-election/104039404"
    },
    {
        "title": "Beyond Biden and Trump, American politicians are amongst the oldest in the world. Is that good for democracy?",
        "date": "Sat 29 Jun",
        "summary": "In the lead-up to the US election, many are concerned that Biden and Trump, the two oldest people to ever run for office in the US, are running again. It's indicative of a broader issue — the average age of the US congress has been climbing for decades. ",
        "url": "https://www.abc.net.au/news/2024-06-30/us-voters-election-old-politicians-congress/104039606"
    },
    {
        "title": "Top Democrats rule out replacing Joe Biden amid calls for him to quit US presidential 2024 race",
        "date": "Mon 1 Jul",
        "summary": "Top US Democrats rule out the possibility of replacing President Joe Biden as the Democratic nominee after a feeble debate performance. ",
        "url": "https://www.abc.net.au/news/2024-07-01/top-democrats-rule-out-replacing-biden-amid-calls-for-him-to-qui/104042414"
    },
    {
        "title": "Donald Trump ally Steve Bannon surrenders at federal prison to serve 4-month sentence on contempt charges ",
        "date": "Tue 2 Jul",
        "summary": "Long-time Donald Trump ally Steve Bannon has been taken into custody after surrendering at a federal prison to begin a sentence on contempt charges for defying a subpoena in the congressional investigation into the US Capitol attack.",
        "url": "https://www.abc.net.au/news/2024-07-02/trump-ally-steve-bannon-surrenders-to-prison-on-contempt-charges/104046736"
    },
    {
        "title": "Donald Trump asks for hush money conviction to be dismissed after Supreme Court rules ex-presidents have some immunity from prosecution",
        "date": "Mon 1 Jul",
        "summary": "America's highest court finds ex-presidents have significant protection from criminal prosecution — a historic ruling that's prompted an appeal of Donald Trump's criminal conviction.",
        "url": "https://www.abc.net.au/news/2024-07-02/donald-trump-immunity-supreme-court-decision/104046210"
    },
    {
        "title": "US presidential candidate Robert F Kennedy Jr says he has 'skeletons in my closet' after sexual assault allegation",
        "date": "Wed 3 Jul",
        "summary": "Independent US presidential candidate Robert F Kennedy Jr says he has \"so many skeletons in my closet,\" following an allegation in a Vanity Fair article that he sexually assaulted a former family babysitter.",
        "url": "https://www.abc.net.au/news/2024-07-03/robert-f-kennedy-junior-sexual-assault-allegation/104054284"
    },
    {
        "title": "Creators vs Congress: The TikTokers fighting America's move to ban the app that changed their lives",
        "date": "Tue 2 Jul",
        "summary": "Brian Firebaugh thanks TikTok for giving him an income, a reality TV victory — and a son. He's one of 170 million American users who could lose access to the app within months.",
        "url": "https://www.abc.net.au/news/2024-07-03/tiktok-ban-creators-vs-congress-joe-biden-bytedance/103995332"
    },
    {
        "title": "Donald Trump's sentencing delayed after US Supreme Court ruling on presidential immunity",
        "date": "Tue 2 Jul",
        "summary": "A New York judge delays Donald Trump's sentencing for criminal conduct until September in the wake of a landmark court ruling on presidential immunity.",
        "url": "https://www.abc.net.au/news/2024-07-03/usa-donald-trump-sentencing-delayed-september/104051412"
    },
    {
        "title": "Rudy Giuliani disbarred in New York as court finds he repeatedly lied about Trump's 2020 election loss",
        "date": "Wed 3 Jul",
        "summary": "Rudolph Giuliani, the former New York City mayor, federal prosecutor and legal adviser to Donald Trump, is disbarred in New York, with a court finding he repeatedly made false statements about Trump's 2020 election loss.",
        "url": "https://www.abc.net.au/news/2024-07-03/giuliani-disbarred-in-new-york-trump-2020-election-loss/104051552"
    },
    {
        "title": "Democratic governors express confidence in Joe Biden as he vows to stay in presidential race",
        "date": "Thu 4 Jul",
        "summary": "Joe Biden has vowed to continue his campaign for re-election in the 2024 US presidential race after a shaky debate performance with Republican Donald Trump. ",
        "url": "https://www.abc.net.au/news/2024-07-04/joe-biden-vows-to-stay-in-presidential-race-after-debate-drama/104056056"
    },
    {
        "title": "Nevada's a key state in the US election — and rising prices could push its voters to turn on the president",
        "date": "Sat 6 Jul",
        "summary": "Christine Cloud never thought she'd be forced to move in with her father in retirement, but the rising cost of living is biting in Nevada. Now, she's an example of Joe Biden's big problem in the crucial swing state.",
        "url": "https://www.abc.net.au/news/2024-07-07/us-election-biden-trump-nevada-cost-of-living/104051554"
    },
    {
        "title": "Four senior US Democrats join calls for Joe Biden to drop re-election bid as party cracks widen",
        "date": "Mon 8 Jul",
        "summary": "Four more of the president's colleagues voice concern about his candidacy for the 2024 election, in a reflection of deepening party division among the Democrats. ",
        "url": "https://www.abc.net.au/news/2024-07-08/democrats-call-on-joe-biden-to-drop-presidential-bid/104070524"
    },
    {
        "title": "Joe Biden digs in for another day with a defiant letter, a surprise interview and frustration with 'the elites'",
        "date": "Mon 8 Jul",
        "summary": "Joe Biden continues to fight for his political life, writing to Democrats in Congress and phoning into a TV show to insist he's not caving to pressure to step aside for a younger presidential candidate. ",
        "url": "https://www.abc.net.au/news/2024-07-09/joe-biden-digs-in-us-presidential-election/103623490"
    },
    {
        "title": "French deadlock, UK elects record number of women – your quick recap of recent elections around the world",
        "date": "Tue 9 Jul",
        "summary": "From surprise swings to new leaders, resignations and campaign speculation, there's been a lot happening in terms of international elections. Here's a quick recap of the latest updates.",
        "url": "https://www.abc.net.au/news/2024-07-09/french-iran-uk-and-us-election-news-latest-recap/104074664"
    },
    {
        "title": "Pressure grows for Joe Biden to drop out of the US presidential campaign ",
        "date": "Thu 11 Jul",
        "summary": "US President Joe Biden is facing fresh doubts about his re-election chances from heavyweights Nancy Pelosi and George Clooney, and analysts say it's likely he'll give into the pressure.",
        "url": "https://www.abc.net.au/news/2024-07-11/joe-biden-pressure-drop-out-presidential-election-donald-trump/104084748"
    },
    {
        "title": "Joe Biden says 'there is no indication' of him slowing down after 'Trump' and 'Putin' gaffes  — as it happened",
        "date": "Thu 11 Jul",
        "summary": "Joe Biden has fronted a solo press conference in Washington DC, his first such appearance in eight months. Look back on our blog to see how the press conference unfolded.",
        "url": "https://www.abc.net.au/news/2024-07-12/joe-biden-press-conference-live-blog/104079562"
    },
    {
        "title": "Seven stand-out moments from Joe Biden's high-pressure press conference",
        "date": "Fri 12 Jul",
        "summary": "The US president addressed the media with mounting calls for him to step down ahead of November's election, as opinion polls show Donald Trump increasing his lead in the wake of Mr Biden's disastrous performance in last month's presidential debate. ",
        "url": "https://www.abc.net.au/news/2024-07-12/joe-biden-press-conference-key-moments/104088900"
    },
    {
        "title": "Meta lifts restrictions on Donald Trump's Facebook and Instagram accounts",
        "date": "Sat 13 Jul",
        "summary": "The social media company says it has a responsibility to ensure Americans can hear from nominees for the US presidency. ",
        "url": "https://www.abc.net.au/news/2024-07-13/donald-trump-facebook-instagram-ban-restrictions-lifted/104094200"
    },
    {
        "title": "Joe Biden reassures supporters 'I'm OK' as Democrats remain split over US election prospects",
        "date": "Fri 12 Jul",
        "summary": "A day after closing the Washington NATO summit and gifting his opponents two highly shareable gaffes, Joe Biden travels to Michigan and makes light of complaints about his age.",
        "url": "https://www.abc.net.au/news/2024-07-13/joe-biden-detroit-democrats-candidacy/104093918"
    },
    {
        "title": "An ABC News journalist was in the crowd when shots rang out at Donald Trump's rally. This is what she saw",
        "date": "Sun 14 Jul",
        "summary": "ABC News journalist Phoebe Hosier was at the campaign rally where Donald Trump was shot. She's described the chaotic scenes that ensued moments after. ",
        "url": "https://www.abc.net.au/news/2024-07-14/abc-news-producer-in-crowd-at-time-of-trump-shooting/104095800"
    },
    {
        "title": "Trump assassination attempt: FBI identifies Pennsylvania rally shooter as Thomas Matthew Crooks, exact motive unknown",
        "date": "Sat 13 Jul",
        "summary": "Two people have been killed, including suspected shooter Thomas Matthew Crooks, and two remain in a critical condition after an attempt on Donald Trump's life at a campaign rally in Pennsylvania. Look back at how the events unfolded.",
        "url": "https://www.abc.net.au/news/2024-07-14/donald-trump-rally-shooting-pennsylvania/104095670"
    },
    {
        "title": "How the deadly shooting at Donald Trump's Pennsylvania campaign rally unfolded",
        "date": "Sun 14 Jul",
        "summary": "A series of shots, two dead and a bloodied ear: what happened in Butler, Pennsylvania at the former president's campaign rally.",
        "url": "https://www.abc.net.au/news/2024-07-14/donald-trump-shooting-how-it-unfolded/104095750"
    },
    {
        "title": "Donald Trump rushed off stage, audience member dead after shots fired at rally in Pennsylvania",
        "date": "Sat 13 Jul",
        "summary": "Donald Trump is rushed off stage with blood on his face and at least two people, including a suspected gunman, are killed at a campaign rally in Pennsylvania.",
        "url": "https://www.abc.net.au/news/2024-07-14/shots-fired-at-trump-rally-in-pennsylvania/104095660"
    },
    {
        "title": "People who worked with Donald Trump on the man who wants to be president again",
        "date": "Sat 13 Jul",
        "summary": "People who worked with Donald Trump are speaking to Four Corners as he makes a bid for his second coming as US president.",
        "url": "https://www.abc.net.au/news/2024-07-14/people-who-worked-with-president-trump-four-corners/104090046"
    },
    {
        "title": "Witnesses say a gunman was spotted on roof near Donald Trump rally minutes before assassination attempt",
        "date": "Sun 14 Jul",
        "summary": "Several minutes before a series of shots were fired towards Donald Trump at a political rally in the United States, a gunman was spotted on a nearby rooftop, according to witnesses.",
        "url": "https://www.abc.net.au/news/2024-07-14/donald-trump-assassination-attempt-us-rally-shooting/104095910"
    },
    {
        "title": "US politicians demanding Secret Service answers after Donald Trump assassination attempt",
        "date": "Sun 14 Jul",
        "summary": "Donald Trump was still receiving treatment from a failed assassination attempt when senior Republican politicians started demanding answers from the US Secret Service. ",
        "url": "https://www.abc.net.au/news/2024-07-14/secret-service-questions-donald-trump-assassination-attempt/104096082"
    },
    {
        "title": "Who was Thomas Matthew Crooks? What we know about the Donald Trump rally shooter",
        "date": "Sun 14 Jul",
        "summary": "The FBI have named Thomas Matthew Crooks, a 20-year-old man from Pennsylvania, as the \"subject involved\" in the attempted assassination of former President Donald Trump.",
        "url": "https://www.abc.net.au/news/2024-07-14/who-was-the-shooter-at-trump-rally-what-we-know-about-gunman/104096364"
    },
    {
        "title": "Slip-ups like Joe Biden's misnaming of Trump and Harris are common, and usually caused by lack of sleep or stress, experts say ",
        "date": "Sat 13 Jul",
        "summary": "US President Joe Biden has made a series of unfortunate name mistakes in the past week, including introducing Ukrainian President Volodymyr Zelenskyy as \"President Putin\". Brain scientists say referring to someone by the wrong name is a common mental slip due to the way our memory is categorised.",
        "url": "https://www.abc.net.au/news/2024-07-14/us-president-joe-biden-slip-ups-trump-misnaming-are-common/104092304"
    },
    {
        "title": "Video shows shooter Thomas Crooks wasn't stopped for nearly two minutes before shooting Donald Trump",
        "date": "Sun 14 Jul",
        "summary": "The near-assassination of Donald Trump was a seminal moment in US history. Through multiple live streams, map data, and eyewitness videos, here's how the rally shooting played out over 11 minutes and 9 seconds.",
        "url": "https://www.abc.net.au/news/2024-07-14/visual-analysis-of-the-attempted-assassination-of-donald-trump/104096376"
    },
    {
        "title": "Merch makers launch into gear after Trump shooting as world leaders send well wishes",
        "date": "Mon 15 Jul",
        "summary": "The image of former US president Donald Trump defiantly raising his fist after being shot became instantly historic. And it is appearing everywhere from mugs to dog cardigans.",
        "url": "https://www.abc.net.au/news/2024-07-15/trump-shooting-world-reax/104098402"
    },
    {
        "title": "Donald Trump arrives in Milwaukee for Republican National Convention after attempted assassination — as it happened",
        "date": "Sun 14 Jul",
        "summary": "Donald Trump has arrived in Milwaukee for the Republican National Convention a day after an attempted assassination at a rally in Pennsylvania. Look back through our blog to see how the day's events unfolded.  ",
        "url": "https://www.abc.net.au/news/2024-07-15/donald-trump-rally-shooting-ongoing-reactions/104096972"
    },
    {
        "title": "From JFK to Trump, assassinations and attempts are rife in US political history",
        "date": "Sun 14 Jul",
        "summary": "The attempted assassination of former president Donald Trump at a rally in Pennsylvania has shocked the world, but US presidents are no strangers to attempts on their lives. ",
        "url": "https://www.abc.net.au/news/2024-07-15/historical-political-assassinations-wake-of-trump-rally-shooting/104095948"
    },
    {
        "title": "US President Joe Biden calls for unity in national address after Donald Trump assassination attempt ",
        "date": "Mon 15 Jul",
        "summary": "In a rare televised address from the Oval Office, Joe Biden asks Americans to lower the political temperature and remember they are neighbours after a would-be assassin injures his Republican rival, Donald Trump.",
        "url": "https://www.abc.net.au/news/2024-07-15/us-president-biden-speaks-on-donald-trump-assassination-attempt/104097838"
    },
    {
        "title": "Donald Trump urges nation to remain 'defiant in the face of wickedness' as more details of Pennsylvania shooting victim revealed ",
        "date": "Sun 14 Jul",
        "summary": "Former president Donald Trump uses social media to thank wellwishers, saying: \"It was God alone who prevented the unthinkable from happening.\" ",
        "url": "https://www.abc.net.au/news/2024-07-15/trump-assassination-attempt-pennsylvania-reaction/104097080"
    },
    {
        "title": "How politics, engagement bait and money opened up a firehose of falsehoods following Trump's shooting",
        "date": "Mon 15 Jul",
        "summary": "Falsehoods about former US president Donald Trump's attempted assassination are spreading online faster than journalists can assemble an accurate account of what we know. ABC News Verify has assembled the key claims, and how they have gained traction.",
        "url": "https://www.abc.net.au/news/2024-07-15/abc-news-verify-trump-assassination-attempt-social-media-misinfo/104101040"
    },
    {
        "title": "Donald Trump classified documents case dismissed, with judge ruling prosecutor Jack Smith was unlawfully appointed",
        "date": "Mon 15 Jul",
        "summary": "A US judge dismisses the criminal case accusing Donald Trump of illegally holding onto classified documents, handing the former president another major legal victory as the Republican seeks a return to the White House.",
        "url": "https://www.abc.net.au/news/2024-07-16/judge-tosses-donald-trump-documents-florida-case/104101344"
    },
    {
        "title": "Donald Trump makes an appearance, and three other big moments from the Republican convention's first day ",
        "date": "Tue 16 Jul",
        "summary": "A bandaged Donald Trump makes his first public appearance since his attempted assassination, and a running mate with a surprising past is announced. These are the big moments from the Republican convention's first day. ",
        "url": "https://www.abc.net.au/news/2024-07-16/donald-trump-vice-president-jd-vance-rnc-america-news/104104008"
    },
    {
        "title": "Project 2025 plan to empower Trump prompts fears for the future of US democracy",
        "date": "Mon 15 Jul",
        "summary": "Trump's march to re-take the White House continues with renewed determination. If he wins he'll have an \"army\" of 10,000 recruits at his disposal to help implement his controversial agenda.",
        "url": "https://www.abc.net.au/news/2024-07-16/trump-project-2025-plan-us-election-four-corners/104015688"
    },
    {
        "title": "Donald Trump picks Ohio senator JD Vance as his running mate for 2024 election at Republican National Convention",
        "date": "Mon 15 Jul",
        "summary": "Donald Trump selects Ohio senator JD Vance as his running mate, at the beginning of a four-day Republican National Convention to confirm the party's presidential ticket.",
        "url": "https://www.abc.net.au/news/2024-07-16/trump-vice-president-candidate-chosen-jd-vance/104101468"
    },
    {
        "title": "Trump makes surprise convention appearance as Biden's high-stakes interview airs — as it happened",
        "date": "Mon 15 Jul",
        "summary": "As Joe Biden's first TV interview since the attempt on Donald Trump's life airs on NBC, the former president makes an unplanned appearance at the Republican National Convention. ",
        "url": "https://www.abc.net.au/news/2024-07-16/donald-trump-live-updates-republican-national-convention/104100000"
    },
    {
        "title": "How JD Vance transformed himself from a Never Trumper to the Republican pick for vice-president",
        "date": "Tue 16 Jul",
        "summary": "When Donald Trump first took office, JD Vance boldly declared he would never support him. So how did this conservative venture capitalist-turned-politician win over the former president to become his pick for Republican vice-president?",
        "url": "https://www.abc.net.au/news/2024-07-17/how-jd-vance-transformed-himself-from-never-trumper-to-vp-pick/104106988"
    },
    {
        "title": "Investigators search laptop, phone of Trump shooter Thomas Matthew Crooks in search for motive as more details emerge",
        "date": "Wed 17 Jul",
        "summary": "Officials are yet to determine 20-year-old Thomas Crooks's motive for carrying out the attack on former president Donald Trump at a Pennsylvania rally.",
        "url": "https://www.abc.net.au/news/2024-07-17/fbi-investigate-background-of-trump-shooter-thomas-crooks/104107716"
    },
    {
        "title": "US officials say Secret Service received intelligence about Iranian plot to assassinate Donald Trump",
        "date": "Tue 16 Jul",
        "summary": "US officials say a threat from Iran prompted the the Secret Service to boost protection around Donald Trump before Saturday's attempted assassination. ",
        "url": "https://www.abc.net.au/news/2024-07-17/secret-service-learned-of-iranian-plot-to-assassinate-trump/104107034"
    },
    {
        "title": "Former Donald Trump rivals Nikki Haley, Ron DeSantis come full circle to endorse him at Republican National Convention — as it happened",
        "date": "Tue 16 Jul",
        "summary": "Former rivals of Donald Trump, including Nikki Haley and Ron DeSantis, have come full circle to endorse him for the presidency at the Republican National Convention. ",
        "url": "https://www.abc.net.au/news/2024-07-17/trump-live-updates-republican-national-convention/104104138"
    },
    {
        "title": "Joe Biden comes down with COVID as pressure builds, while JD Vance takes the stage on day three at the Republican National Convention",
        "date": "Thu 18 Jul",
        "summary": "Newly minted vice-presidential candidate JD Vance stole the show at the Republican National Convention, while President Joe Biden's day took a rough turn.",
        "url": "https://www.abc.net.au/news/2024-07-18/joe-biden-covid-jd-vance-speaks-republican-national-convention/104112318"
    },
    {
        "title": "Trump's VP pick JD Vance addresses Republican National Convention as Biden tests positive for COVID — as it happened",
        "date": "Wed 17 Jul",
        "summary": "Donald Trump's pick for vice president, JD Vance, addresses the Republican National Convention as US President Joe Biden tests positive for COVID-19. ",
        "url": "https://www.abc.net.au/news/2024-07-18/live-updates-donald-trump-republican-national-convention/104109086"
    },
    {
        "title": "Local police say they had not secured rooftop where gunman fired at Donald Trump",
        "date": "Thu 18 Jul",
        "summary": "The gunman who tried to assassinate Donald Trump fired from a rooftop that neither the US Secret Service or local police had secured.",
        "url": "https://www.abc.net.au/news/2024-07-18/secret-service-rooftop-at-trump-shooting-outside-security/104111968"
    },
    {
        "title": "Donald Trump addresses Republican National Convention, Joe Biden 'soul-searching', US media reports",
        "date": "Thu 18 Jul",
        "summary": "Donald Trump has taken the stage at the Republican National Convention for his first public speech since an attempt on his life. Meanwhile, US media is reporting \"reality is setting in\" for a \"soul-searching\" US President Joe Biden as pressure mounts to quit the presidential race.",
        "url": "https://www.abc.net.au/news/2024-07-19/live-updates-donald-trump-speech-republican-convention/104115224"
    },
    {
        "title": "Trump's big speech, letters to Biden, and the biggest moments from day four of the Republican National Convention",
        "date": "Fri 19 Jul",
        "summary": "In a 92-minute speech, Donald Trump used Joe Biden's name only once, and asked a roaring crowd of party faithful to send him back to the White House. Meanwhile, the president endured another day of leaks and anonymous sources citing pressure for him to drop out of the race.",
        "url": "https://www.abc.net.au/news/2024-07-19/republican-national-convention-trump-recalls-shooting/104117584"
    },
    {
        "title": "Biden wants to 'lower the temperature'. But at the Republican National Convention, some say it's about to be 'turned up to 1,000 Fahrenheit'",
        "date": "Thu 18 Jul",
        "summary": "Following the assassination attempt on Donald Trump, political leaders on both sides called for the election campaign to tone down the divisive rhetoric. But inside the Republican National Convention, there are plenty of doubts about America's ability to turn down the heat.",
        "url": "https://www.abc.net.au/news/2024-07-19/inside-the-republican-national-convention-shows-trump-mood/104111824"
    },
    {
        "title": "Joe Biden reportedly 'soul-searching' on whether to fight 2024 presidential race as Obama weighs in",
        "date": "Thu 18 Jul",
        "summary": "The US president, currently isolating with COVID-19, is said to be reflecting on whether to drop out as the presumptive Democratic candidate in the November election.",
        "url": "https://www.abc.net.au/news/2024-07-19/obama-biden-concerns-presidential-candidacy-election-trump/104116794"
    },
    {
        "title": "Joe Biden's campaign says he is 'absolutely' staying in the race, insisting he is the best person to defeat Donald Trump at the election",
        "date": "Fri 19 Jul",
        "summary": "Joe Biden is insistent on staying in the presidential race, despite a growing thrum of concern among senior Democrats who say he may not be able to defeat Donald Trump in the 2024 election.",
        "url": "https://www.abc.net.au/news/2024-07-20/biden-campaign-says-presient-staying-in-election-race/104121008"
    },
    {
        "title": "Donald Trump holds first campaign rally since assassination attempt, with running mate JD Vance in Grand Rapids — as it happened",
        "date": "Sat 20 Jul",
        "summary": "Donald Trump has held his first rally since the assassination attempt at his campaign event last weekend, with his newly minted running mate JD Vance joining him in Grand Rapids, Michigan. ",
        "url": "https://www.abc.net.au/news/2024-07-21/live-updates-donald-trump-rally-grand-rapids-jd-vance/104123216"
    },
    {
        "title": "Inside the abortion clinic where women fear Donald Trump's return to the presidency",
        "date": "Sat 20 Jul",
        "summary": "At stake in the upcoming US election is something Americans once took for granted — and Donald Trump helped take away.",
        "url": "https://www.abc.net.au/news/2024-07-21/abortion-clinic-arizona-fear-trump-us-election/104117622"
    },
    {
        "title": "Donald Trump says he 'took a bullet for democracy' in first campaign rally since assassination attempt",
        "date": "Sat 20 Jul",
        "summary": "Republican presidential candidate Donald Trump holds his first campaign event since the attempt on his life, telling a crowd of supporters he \"took a bullet for democracy\".",
        "url": "https://www.abc.net.au/news/2024-07-21/trump-campaign-rally-grand-rapids/104123232"
    },
    {
        "title": "Joe Biden spent a lifetime working towards the White House. His age ultimately caught up with him",
        "date": "Mon 22 Jul",
        "summary": "Concerns about the 46th US president's age have been around since his 2020 campaign but after a shambolic debate performance, worries about his capacity for another term became too loud to ignore. ",
        "url": "https://www.abc.net.au/news/2024-07-22/joe-biden-reelection-hope-ended-by-age-worries-after-long-career/101359570"
    },
    {
        "title": "From attending protests in a pram to becoming vice-president, who is Kamala Harris?",
        "date": "Sun 21 Jul",
        "summary": "With US President Joe Biden announcing he will not stand for re-election in November, Kamala Harris is seen as a potential successor. But who is she? ",
        "url": "https://www.abc.net.au/news/2024-07-22/who-is-us-vice-president-kamala-harris/104085562"
    },
    {
        "title": "Joe Biden steps aside and endorses Kamala Harris as Democrats' candidate for 2024 election",
        "date": "Sun 21 Jul",
        "summary": "US President Joe Biden announces he is standing down from his re-election campaign and putting his support behind Vice-President Kamala Harris as the Democratic presidential nominee in the 2024 election.",
        "url": "https://www.abc.net.au/news/2024-07-22/joe-biden-steps-aside-as-democratic-presidential-candidate-2024/104124806"
    },
    {
        "title": "Joe Biden's career in pictures: From one of the US's youngest senators to its oldest president",
        "date": "Mon 22 Jul",
        "summary": "Mr Biden has been involved in politics since the early 1970s, going from a local councillor to a US senator to America's vice-president and president. After his announcement that he will not be contesting the upcoming presidential election, we've taken a look back at the long-serving politician's career in pictures.",
        "url": "https://www.abc.net.au/news/2024-07-22/us-president-joe-biden-s-political-career-in-pictures/104117636"
    },
    {
        "title": "Joe Biden quits presidential race, Kamala Harris vows to 'earn and win' the nomination — as it happened",
        "date": "Sun 21 Jul",
        "summary": "US President Joe Biden is ending his re-election bid and pulling out of this year's presidential race, throwing his support behind his Vice-President Kamala Harris.",
        "url": "https://www.abc.net.au/news/2024-07-22/joe-biden-steps-down-as-presidential-candidate/104086192"
    },
    {
        "title": "Kamala Harris says she has secured the support needed to become the Democratic Party's nominee — as it happened",
        "date": "Mon 22 Jul",
        "summary": "Kamala Harris says she is \"proud\" to have secured the broad support of her party to become the presumptive Democratic nominee, after enough delegates pledge their support for her to win the official vote in August.",
        "url": "https://www.abc.net.au/news/2024-07-23/us-election-joe-biden-kamala-harris-live-blog/104128042"
    },
    {
        "title": "Kamala Harris draws on prosecutor past in preview of likely strategy for 2024 US election campaign",
        "date": "Mon 22 Jul",
        "summary": "As Democrats rally behind Kamala Harris as their best presidential hope, the vice-president hits the campaign trail, comparing her background as a criminal prosecutor to Donald Trump's trouble in the courts.",
        "url": "https://www.abc.net.au/news/2024-07-23/democrats-unite-behind-kamala-harris-bid-to-replace-joe-biden/104129290"
    },
    {
        "title": "Joe Biden's 2024 hopes were dashed in the first minutes of the debate. It took Democrats three weeks to convince him",
        "date": "Mon 22 Jul",
        "summary": "Joe Biden, who walked the halls of power for half a century, built a career on relationships. But in the end, it was his decision alone to do something no president had done before. ",
        "url": "https://www.abc.net.au/news/2024-07-23/how-joe-biden-was-persuaded-to-give-up-on-second-term/104117846"
    },
    {
        "title": "At Trump's unfinished border wall, an immigration crisis and a political battle rages",
        "date": "Tue 23 Jul",
        "summary": "Where Trump's unfinished wall ends on Jim's ranch you can simply walk across the border into Mexico. It's the centre of a political battle that will shape the US presidential election.",
        "url": "https://www.abc.net.au/news/2024-07-24/trump-border-wall-arizona-immigration-crisis-us-election/104109074"
    },
    {
        "title": "US Secret Service director Kimberly Cheatle resigns after conceding agency failed to prevent assassination attempt on Donald Trump",
        "date": "Tue 23 Jul",
        "summary": "Kimberly Cheatle has resigned from her position after admitting that the attempted assassination amounted to a failure of her mission to protect America's leaders.",
        "url": "https://www.abc.net.au/news/2024-07-24/secret-service-director-kimberly-cheatle-resigns/104134258"
    },
    {
        "title": "Donald Trump says he wants to debate Kamala Harris before presidential election in November",
        "date": "Tue 23 Jul",
        "summary": "Republican presidential candidate Donald Trump says he is ready to engage in a debate with Kamala Harris ahead of the presidential election, as the presumptive Democratic nominee kicks off her campaign with a rally in Wisconsin.",
        "url": "https://www.abc.net.au/news/2024-07-24/donald-trump-says-he-will-debate-kamala-harris-before-election/104134296"
    },
    {
        "title": "What young people think about the US election 'circus' and how a Trump victory could affect Australia",
        "date": "Wed 24 Jul",
        "summary": "If Donald Trump is returned to power in November's presidential election, for better or worse, the US is in for a big shake-up — one that could be felt for generations in Australia.  ",
        "url": "https://www.abc.net.au/news/2024-07-25/us-election-young-people-trump-victory-impact-in-australia/104128798"
    },
    {
        "title": "Joe Biden gives Oval Office address on his withdrawal from 2024 US presidential election",
        "date": "Wed 24 Jul",
        "summary": "In an Oval Office address to explain why he abandoned his re-election bid, Joe Biden said he believes he's earned a second term as US president, but \"personal ambition\" cannot get in the way of saving democracy.",
        "url": "https://www.abc.net.au/news/2024-07-25/biden-first-address-since-dropping-out-election-race/104138988"
    },
    {
        "title": "Donald Trump shooter Thomas Crooks searched online for JFK assassination, FBI director says",
        "date": "Thu 25 Jul",
        "summary": "Analysis of a laptop that the investigation ties to the shooter revealed on July 6, he did a Google search for  \"how far away was Oswald from Kennedy.\"",
        "url": "https://www.abc.net.au/news/2024-07-25/trump-shooter-searched-online-for-jfk-assassination-fbi-director/104139882"
    },
    {
        "title": "Barack and Michelle Obama endorse Kamala Harris as Democratic candidate",
        "date": "Fri 26 Jul",
        "summary": "The former US president and his wife throw their support behind the current vice-president as the presumptive Democratic presidential candidate.",
        "url": "https://www.abc.net.au/news/2024-07-26/obamas-endorse-kamala-harris-democrat-presidential-nominee/104149286"
    },
    {
        "title": "How one of the most powerful women in America helped put Kamala Harris on the Democratic ticket",
        "date": "Fri 26 Jul",
        "summary": "In the last three weeks, one woman has emerged as the key driver of efforts to push the Democratic Party towards a historic decision. Here's how Nancy Pelosi helped put Kamala Harris on the ticket.",
        "url": "https://www.abc.net.au/news/2024-07-27/inside-the-democrats-battle-with-joe-biden/104129984"
    },
    {
        "title": "When president Lyndon B Johnson decided not to run for re-election, Chicago's Democratic National Convention descended into chaos",
        "date": "Sat 27 Jul",
        "summary": "Before there was violent protest, the National Guard and a pig nominated for office — in August 1968, the Democratic National Convention was facing the same dilemma we are now.",
        "url": "https://www.abc.net.au/news/2024-07-28/1968-democratic-national-convention/104127908"
    },
    {
        "title": "FBI says police noticed Donald Trump shooter more than an hour before assassination attempt",
        "date": "Mon 29 Jul",
        "summary": "The FBI says a local police officer took a photo of gunman Thomas Crooks and sent it to other law enforcement officials at the scene of Donald Trump's Pennsylvania rally before the shooting took place. ",
        "url": "https://www.abc.net.au/news/2024-07-30/trump-gunman-spotted-more-than-an-hour-before-shooting-fbi/104157840"
    },
    {
        "title": "Kamala Harris running mate race narrows, with Roy Cooper and Gretchen Whitmer both out",
        "date": "Tue 30 Jul",
        "summary": "North Carolina Governor Roy Cooper and Michigan Governor Gretchen Whitmer are both out of the race to become Kamala Harris's running mate.",
        "url": "https://www.abc.net.au/news/2024-07-30/kamala-harris-vice-president-race-narrows/104160154"
    },
    {
        "title": "US Secret Service's acting director blames security lapse at Trump's attempted assassination on local police",
        "date": "Wed 31 Jul",
        "summary": "The acting director said his agency had made a mistake in assuming local police would take responsibility for securing the roof where a shooter later opened fire on Donald Trump's rally.",
        "url": "https://www.abc.net.au/news/2024-07-31/secret-service-blames-local-police-for-security-failures-trump/104164294"
    },
    {
        "title": "Project 2025 director ends work on plan for Donald Trump presidency after continued attack from Democrats",
        "date": "Tue 30 Jul",
        "summary": "The director of the \"Project 2025\" plan for a Donald Trump presidency steps down after Democrats made attacking it central to their election campaign and Trump repeatedly distanced himself from it.",
        "url": "https://www.abc.net.au/news/2024-07-31/project-2025-director-ends-work-on-plan-for-trump-presidency/104163090"
    },
    {
        "title": "Donald Trump suggests Kamala Harris suddenly 'became a Black person'",
        "date": "Wed 31 Jul",
        "summary": "Donald Trump uses an appearance at a gathering of Black journalists to suggest his election opponent, Kamala Harris, has switched racial identities from Indian to Black.",
        "url": "https://www.abc.net.au/news/2024-08-01/donald-trump-suggests-kamala-harris-suddenly-became-black/104167996"
    },
    {
        "title": "Kamala Harris secures delegate votes needed to become Democratic nominee",
        "date": "Sat 3 Aug",
        "summary": "Kamala Harris secures the delegate votes needed to clinch the Democratic US presidential nomination and become the first woman of colour at the top of a major party ticket.",
        "url": "https://www.abc.net.au/news/2024-08-03/kamala-harris-secures-enough-vote-to-be-presidential-nominee/104179394"
    },
    {
        "title": "Donald Trump and Kamala Harris clash over details of presidential debate",
        "date": "Sat 3 Aug",
        "summary": "Kamala Harris's campaign team says Donald Trump is trying to back out of a debate scheduled to run on a rival network.",
        "url": "https://www.abc.net.au/news/2024-08-04/donald-trump-says-he-will-debate-kamala-harris-on-fox-news/104180448"
    },
    {
        "title": "Kamala Harris is poised to announce her vice-presidential running mate. Here's who's still in the race",
        "date": "Mon 5 Aug",
        "summary": "Once decided, her VP pick will join her on a tour of multiple battleground states across the US ahead of the Democratic National Convention.",
        "url": "https://www.abc.net.au/news/2024-08-05/kamala-harris-running-mate-vice-president/104169464"
    },
    {
        "title": "US vice-presidential nominee JD Vance called childfree women 'childless cat ladies'. Now, they're hitting back",
        "date": "Mon 5 Aug",
        "summary": "Women around the world have taken to social media to protest comments by the Republican vice-presidential nominee.",
        "url": "https://www.abc.net.au/news/2024-08-06/women-backlash-against-jd-vance-childless-cat-ladies-comments-/104171324"
    },
    {
        "title": "Kamala Harris names Tim Walz as her vice-presidential running mate for 2024 US election",
        "date": "Tue 6 Aug",
        "summary": "Democratic presidential candidate Kamala Harris selects Minnesota Governor Tim Walz to be her running mate in the 2024 election.",
        "url": "https://www.abc.net.au/news/2024-08-06/kamala-harris-vice-presidential-running-mate/104192218"
    },
    {
        "title": "Pakistani man with ties to Iran is charged in plot to carry out political assassinations on US soil",
        "date": "Tue 6 Aug",
        "summary": "A Pakistani man with alleged ties to Iran has been charged in the United States in connection with a foiled plot to assassinate a US politician or government officials, the Department of Justice says. ",
        "url": "https://www.abc.net.au/news/2024-08-07/us-charges-man-alleged-ties-to-iran-in-foiled-assassination-plot/104192864"
    },
    {
        "title": " Kamala Harris says campaign is a 'fight for the future' at first address with running mate Tim Walz — as it happened",
        "date": "Tue 6 Aug",
        "summary": "Democratic presidential candidate Kamala Harris says her vice-president pick Tim Walz \"will be ready from day one\" at rally in Philadelphia. Look back at how it unfolded.",
        "url": "https://www.abc.net.au/news/2024-08-07/kamala-harris-picks-tim-walz-vice-president-candidate/104190026"
    },
    {
        "title": "Who is Tim Walz? Nine things to know about Kamala Harris's vice-presidential running mate",
        "date": "Tue 6 Aug",
        "summary": "Only a few weeks ago, many Americans outside Minnesota had never heard of Tim Walz. Now, he might be the country's next vice-president. Here's what to know about him. ",
        "url": "https://www.abc.net.au/news/2024-08-07/tim-walz-kamala-harris-vice-president-running-mate/104187318"
    },
    {
        "title": "Republicans launch attacks on Tim Walz, labelling the Democratic vice-president candidate 'dangerously liberal' ",
        "date": "Thu 8 Aug",
        "summary": "In the hours since Tim Walz was announced as the Democratic vice-presidential pick, Republicans have been launching attacks to tarnish his image, labelling him \"dangerously liberal\".",
        "url": "https://www.abc.net.au/news/2024-08-08/trump-republicans-attack-vp-tim-walz-us-election/104198990"
    },
    {
        "title": "Police release new bodycam footage of Donald Trump assassination attempt",
        "date": "Fri 9 Aug",
        "summary": "Newly released footage shows a police officer spotting Thomas Crooks just seconds before the attempt on Donald Trump's life.",
        "url": "https://www.abc.net.au/news/2024-08-09/police-release-new-bodycam-footage-of-moment-before-donald-trump/104204106"
    },
    {
        "title": "Donald Trump and Kamala Harris to debate on America's ABC as Trump says he wants two more",
        "date": "Thu 8 Aug",
        "summary": "Donald Trump has agreed to debate Kamala Harris on America's ABC after previously suggesting he could back out of the scheduled debate.",
        "url": "https://www.abc.net.au/news/2024-08-09/donald-trump-and-kamala-harris-to-debate-on-america-abc/104203756"
    },
    {
        "title": "Donald Trump’s campaign says its emails were hacked by Iran without providing evidence",
        "date": "Sat 10 Aug",
        "summary": "The campaign of the Republican US presidential candidate made the statement, without direct evidence, citing previous tensions between the former US president and Iran. ",
        "url": "https://www.abc.net.au/news/2024-08-11/donald-trump-campaign-says-emails-hacked-by-iran/104210858"
    },
    {
        "title": "Joe Biden says Democrats thought he would 'hurt them in the races', in first interview since dropping out of re-election bid",
        "date": "Mon 12 Aug",
        "summary": "The 81-year-old gives his first interview since quitting the race, discussing Donald Trump, the Harris-Walz ticket, and what will be at stake in November.",
        "url": "https://www.abc.net.au/news/2024-08-12/joe-biden-cbs-interview-election/104213200"
    },
    {
        "title": "Nancy Pelosi takes aim at Paul Keating over his 'ridiculous' statement on Taiwan, speaks out on the dangers of Donald Trump",
        "date": "Tue 13 Aug",
        "summary": "Former prime minister Paul Keating's comments on Taiwan draw international attention as former US speaker of the house Nancy Pelosi goes on the attack over his \"Chinese real estate\" remark.",
        "url": "https://www.abc.net.au/news/2024-08-13/pelosi-slams-keating-talks-violence-on-trump/104217798"
    },
    {
        "title": "Elon Musk claims 'massive DDOS attack' on X during Donald Trump interview",
        "date": "Tue 13 Aug",
        "summary": "The site showed that the page was \"not available\" shortly after the scheduled start for some users.",
        "url": "https://www.abc.net.au/news/2024-08-13/elon-musk-claims-massive-ddos-attack-on-x-donald-trump-interview/104217582"
    },
    {
        "title": "Beijing-based 'Green Cicada' AI network uncovered on social media, fears of US election disruption",
        "date": "Tue 13 Aug",
        "summary": "A network of 5,000 accounts apparently being operated using AI has been exposed on X, formerly Twitter, with concerns the Beijing-based operation could be designed to disrupt the coming US election.",
        "url": "https://www.abc.net.au/news/2024-08-13/green-cicada-beijing-ai-network-uncovered-social-media-x/104219752"
    },
    {
        "title": "Can Tim Walz really help Kamala Harris win the US election? Democrats in this crucial swing state think so",
        "date": "Mon 12 Aug",
        "summary": "Once a Democratic stronghold, Wisconsin flipped for Trump in 2016. Now, both Republicans and Democrats are scrambling for votes in America's \"dairyland\".",
        "url": "https://www.abc.net.au/news/2024-08-13/how-harris-and-walz-fare-against-trump-in-americas-heartland/104213402"
    },
    {
        "title": "Donald Trump mocks Kamala Harris's voice and appearance in rally speech laden with insults",
        "date": "Sun 18 Aug",
        "summary": "Donald Trump suggests Kamala Harris approaches economic policy in \"a communist way\" and calls her a \"lunatic\" ahead of the Democratic National Convention.",
        "url": "https://www.abc.net.au/news/2024-08-18/donald-trump-launches-personal-attacks-on-biden-and-macron/104239176"
    },
    {
        "title": "US intelligence officials say Iran is to blame for hack of Donald Trump's presidential campaign",
        "date": "Mon 19 Aug",
        "summary": "The joint statement from the FBI and other federal agencies was the first formal attribution of the hack to a foreign entity.",
        "url": "https://www.abc.net.au/news/2024-08-20/us-intelligence-officials-say-iran-is-to-blame-for-hack-of-trump/104245448"
    },
    {
        "title": "Kamala Harris makes a surprise appearance and Joe Biden speaks: Key moments from the Democratic National Convention",
        "date": "Tue 20 Aug",
        "summary": "On a night that was meant to be a celebration of his bid for a second term, Joe Biden was moved to tears as he endorsed Kamala Harris. Here's what you missed from day one of the Democratic Convention. ",
        "url": "https://www.abc.net.au/news/2024-08-20/key-takeaways-from-day-1-of-kamala-harris-democratic-convention/104246118"
    },
    {
        "title": "Joe Biden and Hillary Clinton lead speeches as Kamala Harris appears at Democratic National Convention — as it happened",
        "date": "Mon 19 Aug",
        "summary": "The Democratic National Convention kicks off in Chicago, with Hillary Clinton speaking ahead of Joe Biden's keynote address to thousands of delegates celebrating presidential nominee Kamala Harris. Look back on our blog to see how the day's events unfolded.",
        "url": "https://www.abc.net.au/news/2024-08-20/democratic-national-convention-updates-joe-biden-kamala-harris/104241570"
    },
    {
        "title": "Michelle and Barack Obama go after Trump and delegates dance: Big moments from day two of the Democratic convention",
        "date": "Wed 21 Aug",
        "summary": "After some hiccups on the first day, organisers of the Democratic National Convention brought out the big guns for day two: The Obamas and a dance party. Here's what you missed.",
        "url": "https://www.abc.net.au/news/2024-08-21/michelle-barack-obama-speak-day-2-dnc/104250708"
    },
    {
        "title": "Michelle and Barack Obama, Doug Emhoff, Bernie Sanders and Jack Schlossberg address day two of the Democratic National Convention — as it happened",
        "date": "Tue 20 Aug",
        "summary": "Michelle and Barack Obama headlined the second day of the Democratic National Convention, as second gentleman Doug Emhoff took to the stage, along with John F Kennedy's grandson, Jack Schlossberg.",
        "url": "https://www.abc.net.au/news/2024-08-21/live-blog-day-2-democratic-national-convention/104243466"
    },
    {
        "title": "VP pick Tim Walz, Bill Clinton, Nancy Pelosi and Oprah headline third day of Democratic National Convention — as it happened",
        "date": "Wed 21 Aug",
        "summary": "Minnesota Governor Tim Walz formally accepts the Democratic party nomination for vice-president on the third day of the Democratic National Convention, where big-name Democrats Bill Clinton and Nancy Pelosi also spoke.",
        "url": "https://www.abc.net.au/news/2024-08-22/live-blog-day-3-democratic-national-convention-bill-clinton/104247028"
    },
    {
        "title": "Donald Trump appears behind bulletproof glass at first outdoor rally since his attempted assassination ",
        "date": "Thu 22 Aug",
        "summary": "At his first outdoor rally since last month's attempted assassination, Donald Trump spoke from behind bulletproof glass, but he also casually wandered out to greet crowds. ",
        "url": "https://www.abc.net.au/news/2024-08-22/donald-trump-rally-north-carolina-bullet-proof-glass-assassin/104255438"
    },
    {
        "title": "Tim Walz, Oprah and Bill Clinton deliver the biggest moments on day three of the Democratic National Convention",
        "date": "Thu 22 Aug",
        "summary": "With Oprah sneaking in for a surprise address and Bill Clinton returning to the spotlight, Tim Walz enjoyed a star-studded opening act before he made his debut. This is what you missed on day three of the Democratic convention. ",
        "url": "https://www.abc.net.au/news/2024-08-22/tim-walz-speaks-on-day-three-of-democratic-convention/104255716"
    },
    {
        "title": "Kamala Harris formally accept her party's nomination on last day of Democratic National Convention — as it happened",
        "date": "Thu 22 Aug",
        "summary": "US Vice-President Kamala Harris has closed out the Democratic National Convention with one of the biggest speeches of her career as she accepted her party's nomination.",
        "url": "https://www.abc.net.au/news/2024-08-23/live-updates-kamala-harris-democratic-national-convention/104260236"
    },
    {
        "title": "Kamala Harris makes her pitch to the American people on the final day of the Democratic National Convention. These were the big moments",
        "date": "Fri 23 Aug",
        "summary": "After weeks of turmoil and President Joe Biden's historic decision to step aside, Kamala Harris has made her pitch to the American people to vote for her over Donald Trump. Here's what you missed. ",
        "url": "https://www.abc.net.au/news/2024-08-23/kamala-harris-day-four-democratic-convention/104260906"
    },
    {
        "title": "A history of US Secret Service failures from JFK to Donald Trump",
        "date": "Thu 22 Aug",
        "summary": "Each time the Secret Service fails, it learns and adapts to keep its \"protectees\" safe. Can it fulfil its duties of keeping wannabe presidents Donald Trump and Kamala Harris safe in the lead up to the US election?",
        "url": "https://www.abc.net.au/news/2024-08-23/secret-service-failures-us-election-trump-harris/104235888"
    },
    {
        "title": "Iranian, Russian and Chinese hackers are targeting the upcoming US election at an ever increasing pace",
        "date": "Fri 23 Aug",
        "summary": "The intelligence community is warning of an increase in US election interference as voting day approaches. But each set of hackers have their own methods and motives.",
        "url": "https://www.abc.net.au/news/2024-08-24/iran-russia-china-election-interference-in-united-states-2024/104252926"
    },
    {
        "title": "Secret Service agents placed on administrative leave after Trump assassination attempt",
        "date": "Sat 24 Aug",
        "summary": "At least five Secret Service agents have been placed on modified duty after the failed attempt to assassinate US presidential candidate Donald Trump. ",
        "url": "https://www.abc.net.au/news/2024-08-24/secret-service-agents-placed-leave-after-trump-shooting/104265554"
    },
    {
        "title": "Robert F Kennedy Jr suspends US presidential campaign and backs Donald Trump",
        "date": "Fri 23 Aug",
        "summary": "Robert F Kennedy Jr, who was running for the US presidential election as an independent, says he no longer believes he has a \"realistic path to victory\".",
        "url": "https://www.abc.net.au/news/2024-08-24/robert-f-kennedy-jr-pulls-out-of-us-presidential-race/104265170"
    },
    {
        "title": "The Democrats working inside the party to persuade Kamala Harris to stop weapons for Israel",
        "date": "Sat 24 Aug",
        "summary": "While America's Democratic diehards enjoyed pep talks and pop music at their party-vibes convention this week, a smaller panel event on the sidelines was striking a very different tone. ",
        "url": "https://www.abc.net.au/news/2024-08-25/democratic-convention-uncommitted-movement-kamala-harris/104267026"
    },
    {
        "title": "Former Liberal AG George Brandis says Trump is 'too dangerous' to the West to become president again",
        "date": "Mon 26 Aug",
        "summary": "George Brandis, a former Liberal MP and foreign diplomat, tells Q+A that Kamala Harris has to win because Donald Trump would start World War III.",
        "url": "https://www.abc.net.au/news/2024-08-26/george-brandis-says-donald-trump-dangerous-backs-kamala-harris/104272206"
    },
    {
        "title": "House of Representatives task force visits scene of Donald Trump attempted assassination as part of ongoing investigation",
        "date": "Tue 27 Aug",
        "summary": "Members of a task force investigating the attempted assassination of former president Donald Trump visit the scene of the attack. ",
        "url": "https://www.abc.net.au/news/2024-08-27/trump-assassination-task-force-latest/104274132"
    },
    {
        "title": "Donald Trump faces revised US indictment in 2020 election subversion case",
        "date": "Tue 27 Aug",
        "summary": "A revised indictment is filed against former US president Donald Trump in the case involving alleged interference of the 2020 US election.",
        "url": "https://www.abc.net.au/news/2024-08-28/donald-trump-indictment-in-election-subversion-case/104278118"
    },
    {
        "title": "Donald Trump shooter also searched for information on Joe Biden ahead of assassination attempt, says FBI",
        "date": "Wed 28 Aug",
        "summary": "The FBI says Thomas Matthew Crooks spent months looking into both the Republican and Democratic parties, including their national conventions, before settling on Donald Trump as a target for a shooting.",
        "url": "https://www.abc.net.au/news/2024-08-29/donald-trump-shooter-spent-months-seeking-target/104283600"
    },
    {
        "title": "Kamala Harris and Tim Walz sit down for first interview since election campaign began — as it happened",
        "date": "Thu 29 Aug",
        "summary": "US Vice-President Kamala Harris and her running mate Tim Walz have sat down for their first interview with CNN since President Joe Biden withdrew from his White House bid. Look back at how it unfolded.",
        "url": "https://www.abc.net.au/news/2024-08-30/kamala-harris-tim-walz-cnn-interview-live-updates/104286472"
    },
    {
        "title": "From Kamala Harris's awkward answer to Tim Walz's emotion, these were the big moments from their CNN interview",
        "date": "Fri 30 Aug",
        "summary": "The stakes for Kamala Harris and Tim Walz were high as they sat down with CNN for their first interview since Joe Biden stepped aside. These were the biggest moments. ",
        "url": "https://www.abc.net.au/news/2024-08-30/kamala-harris-tim-walz-cnn-key-moments/104289926"
    },
    {
        "title": "Kamala Harris says Donald Trump 'disrespected sacred ground' at Arlington National Cemetery",
        "date": "Sun 1 Sep",
        "summary": "Vice-President Kamala Harris said in a statement on X that Donald Trump \"disrespected sacred ground all for the sake of a political stunt,\" when he took photographs at Arlington National Cemetery. ",
        "url": "https://www.abc.net.au/news/2024-09-01/kamala-harris-says-trump-disrespected-sacred-ground-at-arlington/104296312"
    },
    {
        "title": "Anthony Scaramucci says a second Donald Trump presidency would isolate the United States, leave NATO stranded and project 'cruelty'",
        "date": "Wed 4 Sep",
        "summary": "Anthony Scaramucci did not last long in the Trump administration but he is certain of one thing: four more years of Trump could have potentially disastrous consequences for the United States and the world.",
        "url": "https://www.abc.net.au/news/2024-09-04/anthony-scaramucci-opens-up-donald-trump-kamala-harris-nato/104309994"
    },
    {
        "title": "US accuses Russian state media of working to influence 2024 presidential election",
        "date": "Wed 4 Sep",
        "summary": "Two employees at Russia's RT are charged with money laundering after paying a US company to sway the 2024 election via YouTube videos.",
        "url": "https://www.abc.net.au/news/2024-09-05/us-charges-russia-today-employees-2024-presidential-election/104312844"
    },
    {
        "title": "Donald Trump's sentencing in porn star 'hush money' case delayed until after US election",
        "date": "Fri 6 Sep",
        "summary": "A New York judge postpones Donald Trump's sentencing for his \"hush money\" crimes until after the upcoming US election. ",
        "url": "https://www.abc.net.au/news/2024-09-07/donald-trump-hush-money-sentencing-delayed/104323078"
    },
    {
        "title": "What time is the Trump-Harris presidential debate? Here's how to watch in Australia",
        "date": "Sun 8 Sep",
        "summary": "Any doubts about whether a debate could change the course of a presidential campaign have been put to rest. So both Donald Trump and Kamala Harris are awake to the high stakes of today's face-off.",
        "url": "https://www.abc.net.au/news/2024-09-09/kamala-harris-donald-trump-abc-presidential-debate-preview/104318098"
    },
    {
        "title": "In Georgia, Democrats fear a Republican-controlled board could try to 'rig' the 2024 US election",
        "date": "Mon 9 Sep",
        "summary": "A shake-up of the state election board in Georgia means it's now controlled by Republicans, who are changing voting rules. Democrats say it could be an attempt to \"rig\" the result.",
        "url": "https://www.abc.net.au/news/2024-09-10/georgia-state-election-board-donald-trump-us-election/104104898"
    },
    {
        "title": "Donald Trump and Kamala Harris clashed in their first presidential debate before Taylor Swift spoke up",
        "date": "Wed 11 Sep",
        "summary": "In the last debate of this election, Joe Biden saw his 2024 ambitions evaporate. This time, his deputy Kamala Harris went in determined to ruffle Donald Trump's feathers. These were the big moments.",
        "url": "https://www.abc.net.au/news/2024-09-11/donald-trump-kamala-harris-debate-key-takeaways/104336370"
    },
    {
        "title": "Taylor Swift endorses Kamala Harris following first presidential debate with Donald Trump",
        "date": "Wed 11 Sep",
        "summary": "Taylor Swift posted she would endorse Kamala Harris following the presidential debate. ",
        "url": "https://www.abc.net.au/news/2024-09-11/taylor-swift-endorses-kamala-harris-following-presidential/104337896"
    },
    {
        "title": "Trump argues with moderators, while Harris defends her values in first debate as candidate — as it happened",
        "date": "Tue 10 Sep",
        "summary": "Presidential candidates Donald Trump and Kamala Harris have faced off in a fiery debate in Philadelphia, with Trump clashing repeatedly with the moderators. Take a look back through our live blog to see how it unfolded.",
        "url": "https://www.abc.net.au/news/2024-09-11/live-trump-harris-presidential-debate-latest/104328002"
    },
    {
        "title": "Donald Trump says Taylor Swift will 'probably pay a price' for backing Kamala Harris",
        "date": "Wed 11 Sep",
        "summary": "Republican presidential candidate Donald Trump says it was just a \"question of time\" before pop megastar Taylor Swift backed his Democratic rival, Kamala Harris.",
        "url": "https://www.abc.net.au/news/2024-09-12/donald-trump-taylor-swift-kamala-harris-endorsement/104340960"
    },
    {
        "title": "Donald Trump says he won't debate Kamala Harris again before the US presidential election",
        "date": "Thu 12 Sep",
        "summary": "Donald Trump rules out a third presidential debate before the November 5 election, with Kamala Harris saying \"we owe it to the voters\". ",
        "url": "https://www.abc.net.au/news/2024-09-13/trump-says-no-third-debate-against-kamala-harris/104346776"
    },
    {
        "title": "In the US election race between Donald Trump and Kamala Harris,  America can't escape the shadow of history",
        "date": "Sat 14 Sep",
        "summary": "Of all the schisms that cleave contemporary America, few are more stark than the divide between those who consider themselves to be victims of US history and those who fear they will be casualties of its future.",
        "url": "https://www.abc.net.au/news/2024-09-15/us-election-america-cant-escape-its-history/104305618"
    },
    {
        "title": "Suspect held after apparent assassination attempt on Trump at Florida golf course — as it happened",
        "date": "Sun 15 Sep",
        "summary": "Investigators say a Secret Service agent opened fire on a gunman at Trump's Florida golf course after seeing a rifle barrel poking through a fence while the former president was on the course. A suspect has been taken into custody. Look back on our live coverage.",
        "url": "https://www.abc.net.au/news/2024-09-16/donald-trump-assassination-bid-coverage/104354906"
    },
    {
        "title": "Donald Trump confirmed safe after Secret Service opens fire at armed man near his Florida golf course",
        "date": "Sun 15 Sep",
        "summary": "The FBI is investigating a potential assassination attempt on Donald Trump after a Secret Service agent opened fire on a person with a firearm near the former president's golf club in West Palm Beach, Florida. ",
        "url": "https://www.abc.net.au/news/2024-09-16/shots-reported-near-donald-trump/104354696"
    },
    {
        "title": "Donald Trump under lesser security on golf course during second apparent assassination attempt because 'he's not the sitting president' ",
        "date": "Mon 16 Sep",
        "summary": "Officials say if Donald Trump was still the president, \"the entire course\" would have been in lockdown when an alleged would-be assassin took aim. ",
        "url": "https://www.abc.net.au/news/2024-09-16/trump-security-detail-mar-a-lago/104355158"
    },
    {
        "title": "Ryan Routh charged with gun crimes after apparent assassination attempt on Donald Trump in Florida",
        "date": "Mon 16 Sep",
        "summary": "The man suspected of an apparent assassination attempt on Donald Trump camped outside a golf course with food and a rifle for nearly 12 hours before being spotted by the Secret Service, according to court documents.",
        "url": "https://www.abc.net.au/news/2024-09-17/donald-trump-ryan-routh-assassination-attempt-court-florida/104358742"
    },
    {
        "title": "Ryan Routh claims he voted for Trump in 2016. Now he's accused of trying to kill him. Here's what we know about him from his online activity",
        "date": "Mon 16 Sep",
        "summary": "An investigation into the digital footprint of Donald Trump's alleged would-be assassin Ryan Routh paints a vivid and contradictory picture of his mindset.",
        "url": "https://www.abc.net.au/news/2024-09-17/who-is-suspected-would-be-trump-assassin-ryan-routh/104357720"
    },
    {
        "title": "What the charges and court documents tell us about the apparent second attempt on Donald Trump's life",
        "date": "Tue 17 Sep",
        "summary": "The suspect in an apparent assassination attempt on Donald Trump has appeared in court. This is what we learned from Mr Routh's first court appearance, documents provided to the court, and what could happen next.",
        "url": "https://www.abc.net.au/news/2024-09-17/trump-attempted-assassination-court-documents/104359728"
    },
    {
        "title": "Microsoft says Kamala Harris's presidential bid is a growing target for Russian disinformation campaign ahead of 2024 election",
        "date": "Wed 18 Sep",
        "summary": "Kamala Harris's bid for the US presidency has become a key target of Russian disinformation campaigners focusing on the Democratic campaign, Microsoft says.",
        "url": "https://www.abc.net.au/news/2024-09-18/microsoft-says-kamala-harris-target-russian-disinformation/104366072"
    },
    {
        "title": "Secret Service report details litany of communication failures preceding July assassination attempt on Donald Trump",
        "date": "Sat 21 Sep",
        "summary": "A report reveals numerous \"deficiencies\" in the security preparations ahead of Trump's attempted assassination, in the most formal attempt by the Secret Service to catalogue its errors of the day.",
        "url": "https://www.abc.net.au/news/2024-09-21/secret-service-admits-failure-before-trump-assassination-attempt/104379878"
    },
    {
        "title": "'That will be it': Trump says he will not run again if he loses in November",
        "date": "Mon 23 Sep",
        "summary": "Former president Donald Trump says that he will not make a fourth consecutive run for the US presidency if he loses the upcoming election.",
        "url": "https://www.abc.net.au/news/2024-09-23/trump-says-he-will-not-run-again-if-he-loses-in-november/104383600"
    },
    {
        "title": "Ryan Routh wrote letter describing 'assassination attempt' on Trump, prosecutors say",
        "date": "Mon 23 Sep",
        "summary": "The man accused of hiding out with a gun near Donald Trump's Florida golf course in an apparent bid to kill the former president wrote a letter months earlier describing an \"assassination attempt\", prosecutors say.",
        "url": "https://www.abc.net.au/news/2024-09-23/ryan-routh-letter-assassination-attempt-trump-prosecutors-say/104386888"
    },
    {
        "title": "Would-be Trump assassin was in sniper's line of fire for 'mere seconds' before being taken out, House committee report reveals",
        "date": "Thu 26 Sep",
        "summary": "A new report gives the most detailed timeline to date of how the Pennsylvania assassination attempt unfolded, revealing the shooter was on the roof for six minutes before he opened fire.",
        "url": "https://www.abc.net.au/news/2024-09-26/trump-report-house-committee-assassination-pennsylvania/104399876"
    },
    {
        "title": "US economy will suffer regardless of a Donald Trump or Kamala Harris win, former treasurer Joe Hockey warns",
        "date": "Thu 26 Sep",
        "summary": "The former Australian treasurer and ambassador to the United States, Joe Hockey, says the US dollar will grow weaker under either of the platforms of US presidential hopefuls Donald Trump and Kamala Harris. He also warned the Republican that he had made \"absurd\" spending commitments.",
        "url": "https://www.abc.net.au/news/2024-09-26/joe-hockey-us-economy-warning-trump-harris-presidency/104401790"
    },
    {
        "title": "Donald Trump agrees to meet Volodymyr Zelenskyy in US after Ukrainian president's reception at White House",
        "date": "Fri 27 Sep",
        "summary": "Ukrainian President Volodymyr Zelenskyy meets with US President Joe Biden and Vice-President Kamala Harris at the White House after addressing the UN General Assembly this week.",
        "url": "https://www.abc.net.au/news/2024-09-27/volodymyr-zelenskyy-visits-white-house-meets-with-biden-harris/104403940"
    },
    {
        "title": "Melania Trump rarely gives interviews. Here are five takeaways from her sit-down with Fox",
        "date": "Fri 27 Sep",
        "summary": "Former first lady Melania Trump has sat down for a rare interview in which she reviewed Donald Trump's political record and recounted the moment she learned her husband had been shot in an assassination attempt. ",
        "url": "https://www.abc.net.au/news/2024-09-27/five-key-takeaways-from-rare-melania-trump-interview/104405284"
    },
    {
        "title": "Multiple Iranians indicted in connection with Donald Trump presidential campaign hack, Politico reports",
        "date": "Fri 27 Sep",
        "summary": "A US grand jury has indicted multiple Iranians on charges related to hacking Donald Trump's 2024 presidential campaign. ",
        "url": "https://www.abc.net.au/news/2024-09-27/iranians-indicted-in-connection-with-trump-campaign-hack/104403876"
    },
    {
        "title": "Ukrainian President Volodymyr Zelenskyy meets Donald Trump for first time since Russia's invasion of Ukraine",
        "date": "Fri 27 Sep",
        "summary": "Ukrainian President Volodymyr Zelenskyy presents his \"victory plan\" to Donald Trump during a closed-door meeting, after the US presidential candidate vowed to work with both Ukraine and Russia to end their conflict.",
        "url": "https://www.abc.net.au/news/2024-09-28/ukrainian-president-zelenskyy-meets-trump-in-new-york/104408344"
    },
    {
        "title": "What time is the Walz-Vance VP debate? Here's how to watch in Australia",
        "date": "Mon 30 Sep",
        "summary": "Tim Walz and JD Vance haven't spent much time on the national stage – so a lot of Americans don't know too much about them. The debate is one of their best shots to win over voters in an election race that remains tight.",
        "url": "https://www.abc.net.au/news/2024-10-01/tim-walz-jd-vance-how-to-watch-cbs-vice-presidential-debate/104415864"
    },
    {
        "title": "Democrats Abroad spending up to entice American citizens overseas to back Kamala Harris as next US president",
        "date": "Tue 1 Oct",
        "summary": "Americans face what looms as a tight and pivotal election on November 5. The battleground states are a factor but so is the fight for the overseas vote, including here, in Australia.",
        "url": "https://www.abc.net.au/news/2024-10-01/australian-voters-pivotal-to-us-presidential-election/104418018"
    },
    {
        "title": "Donald Trump suspect Ryan Routh pleads not guilty to attempted assassination at Florida golf course",
        "date": "Mon 30 Sep",
        "summary": "Ryan Routh, 58, entered the plea to five federal charges that include attempted assassination of a major presidential candidate.",
        "url": "https://www.abc.net.au/news/2024-10-01/trump-suspect-pleads-not-guilty-to-attempted-assassination/104415698"
    },
    {
        "title": "Tim Walz and JD Vance have faced off in their one and only US vice-presidential debate. These were the big moments",
        "date": "Wed 2 Oct",
        "summary": "Vice-presidential debates are usually low-stakes affairs. But in a US election of twists and turns, this one took on a greater significance. These were the key moments. ",
        "url": "https://www.abc.net.au/news/2024-10-02/walz-vance-vp-debate-key-takeaways/104421310"
    },
    {
        "title": "Tim Walz and JD Vance defend running mates' pain points in New York vice-presidential debate — as it happened",
        "date": "Tue 1 Oct",
        "summary": "Vice-presidential candidates Tim Walz and JD Vance clashed on topics including climate change, abortion and gun violence in a head-to-head debate in New York City.",
        "url": "https://www.abc.net.au/news/2024-10-02/vice-presidential-debate-tim-walz-vs-jd-vance-live-updates/104420796"
    },
    {
        "title": "Inside the Republican strategy that could cost Kamala Harris this crucial swing state",
        "date": "Wed 2 Oct",
        "summary": "Kamala Harris needs to win Michigan, but the Republican strategy to swing the state is stronger than you might think.",
        "url": "https://www.abc.net.au/news/2024-10-03/kamala-harris-should-have-michigan-in-the-bag-she-doesnt/104399584"
    },
    {
        "title": "Trump 'resorted to crimes' in scramble to overturn US election, unsealed court documents allege",
        "date": "Thu 3 Oct",
        "summary": "Donald Trump laid the groundwork to try overturn the 2020 election even before he lost, knowingly pushed false claims of voter fraud, and \"resorted to crimes\" in his failed bid to cling to power, according to a newly unsealed court filing. ",
        "url": "https://www.abc.net.au/news/2024-10-03/trump-election-interference-filing-unsealed/104426280"
    },
    {
        "title": "Former Colorado county clerk Tina Peters sentenced to 9 years in prison for 2020 presidential race voting data scheme",
        "date": "Fri 4 Oct",
        "summary": "Jurors found Tina Peters guilty in August for allowing a man to misuse a security card to access to the Mesa County election system and for being deceptive about that person's identity.",
        "url": "https://www.abc.net.au/news/2024-10-04/tina-peters-jailed-2020-presidential-race-voting-data-scheme/104432262"
    },
    {
        "title": "Donald Trump returns to site of Pennsylvania assassination attempt for Butler rally, with Elon Musk joining him on stage",
        "date": "Sun 6 Oct",
        "summary": "Donald Trump returns to Pennsylvania, where he was nearly assassinated in July, holding a rally with heightened security and guest Elon Musk. ",
        "url": "https://www.abc.net.au/news/2024-10-06/donald-trump-returns-to-assassination-attempt-rally/104438024"
    },
    {
        "title": "US Vice-President Kamala Harris rejects JD Vance 'mean-spirited' comments in rare interview",
        "date": "Mon 7 Oct",
        "summary": "The US vice-president opened a media blitz by the Democratic ticket on Sunday by appearing on the Call Her Daddy podcast hosted by Alex Cooper.",
        "url": "https://www.abc.net.au/news/2024-10-07/us-vice-president-kamala-harris-rejects-jd-vance-comments/104440616"
    },
    {
        "title": "FBI arrests Afghan man for allegedly planning election day terror attack",
        "date": "Tue 8 Oct",
        "summary": "The FBI said Nasir Ahmad Tawhedi, 27, was plotting the attack in the name of Islamic State and was going to target large crowds. ",
        "url": "https://www.abc.net.au/news/2024-10-09/fbi-arrests-afghan-man-for-planned-terror-attack/104448570"
    },
    {
        "title": "Why overseas voters are getting so much attention in the 2024 US election",
        "date": "Wed 9 Oct",
        "summary": "The millions of US citizens who live overseas rarely get any attention. In 2024, it's a different story.",
        "url": "https://www.abc.net.au/news/2024-10-10/us-overseas-voters-under-the-microscope-election-trump-harris/104449064"
    },
    {
        "title": "The polls in the US presidential race are neck and neck but election whisperer Dr Allan Lichtman says America has already decided",
        "date": "Thu 10 Oct",
        "summary": "Professor Allan Lichtman is the \"Nostradamus\" of US politics. His system has seen him predict the winner of elections consistently since the 1980s and he believes this one is already in the bag. ",
        "url": "https://www.abc.net.au/news/2024-10-10/allan-lichtman-us-election-prediction-keys-kamala-harris/104455998"
    },
    {
        "title": "Kamala Harris's doctor reports she's in 'excellent health', as her campaign looks to draw a contrast with Donald Trump",
        "date": "Sat 12 Oct",
        "summary": "Dr Joshua Simmons, a US Army colonel and physician to the vice-president, wrote that Ms Harris, 59, maintains a healthy, active lifestyle and that she \"possesses the physical and mental resiliency\" required to serve as president.",
        "url": "https://www.abc.net.au/news/2024-10-13/vice-president-kamala-harris-physician-letter-medical-records/104466100"
    },
    {
        "title": "Donald Trump and Kamala Harris desperately want to win Arizona — and women could hold the key to victory",
        "date": "Sat 12 Oct",
        "summary": "Just weeks before the US election, polls suggest the race between Kamala Harris and Donald Trump remains a dead heat. In the key battleground state of Arizona, abortion might be a deciding factor.",
        "url": "https://www.abc.net.au/news/2024-10-13/us-election-arizona-abortion-harris-trump-vote/104442760"
    },
    {
        "title": "Man arrested with weapons at Donald Trump rally identified as Vem Miller as local police say he posed as a journalist",
        "date": "Sun 13 Oct",
        "summary": "Police reveal they arrested a man with multiple weapons outside a Donald Trump rally on Saturday, local time.",
        "url": "https://www.abc.net.au/news/2024-10-14/trump-rally-man-arrested-weapons-california-riverside-county/104468236"
    },
    {
        "title": "The upcoming US election could be the closest in more than two decades, expert says",
        "date": "Mon 14 Oct",
        "summary": "When Americans turn up to the ballot box next month, it could be the tightest election in more than two decades, according to a US politics expert.",
        "url": "https://www.abc.net.au/news/2024-10-15/us-election-could-be-closest-since-2000-expert-says/104470654"
    },
    {
        "title": "Kamala Harris brands Donald Trump a 'risk for America' after former president's 'enemy within' comments",
        "date": "Tue 15 Oct",
        "summary": "Presidential candidate Kamala Harris has told supporters a second Donald Trump term would have \"brutally serious\" consequences after the former president made ominous comments about an \"enemy within\".",
        "url": "https://www.abc.net.au/news/2024-10-15/kamala-harris-warns-second-trump-term-a-huge-risk-for-america/104474838"
    },
    {
        "title": "Donald Trump campaign event morphs into singalong session after audience members fall ill",
        "date": "Wed 16 Oct",
        "summary": "The US presidential candidate wrapped up his event ahead of schedule but remained on stage while nine songs played. ",
        "url": "https://www.abc.net.au/news/2024-10-16/donald-trump-dances-pennsylvania-campaign-event-music/104477824"
    },
    {
        "title": "Donald Trump calls himself the 'father of IVF' in attempt to court female voters in Georgia",
        "date": "Wed 16 Oct",
        "summary": "The Republican nominee and former US president also said some abortion bans in the US were \"too tough\" during the all-female town hall in Georgia. ",
        "url": "https://www.abc.net.au/news/2024-10-17/donald-trump-says-he-is-the-father-of-ivf/104482228"
    },
    {
        "title": "Kamala Harris pressed on immigration, Biden's fitness for office in first interview with Fox News",
        "date": "Thu 17 Oct",
        "summary": "US Vice-President Kamala Harris has been grilled in a televised interview on the Biden administration's efforts to tackle a surge in illegal immigration at the southern border, blaming Republicans for failing to pass a border bill.\n\n ",
        "url": "https://www.abc.net.au/news/2024-10-17/kamala-harris-interview-with-fox-news-pressed-immigration/104482948"
    },
    {
        "title": "After Donald Trump blamed Haitian migrants for 'massive crime' in this tiny town, local tensions blew up",
        "date": "Wed 16 Oct",
        "summary": "Soon after Donald Trump claimed Haitian migrants were eating cats and dogs in Ohio, he turned his attention to another part of the US.",
        "url": "https://www.abc.net.au/news/2024-10-17/trump-harris-election-charleroi-pennsylvania-haitian-immigration/104474320"
    },
    {
        "title": "The global rise of political 'nepo babies': Who is Jack Schlossberg, the heir to the Kennedy dynasty? ",
        "date": "Fri 18 Oct",
        "summary": "Whether he likes it or not, Jack Schlossberg is the heir to the Kennedy American political dynasty. But can we really blame \"nepo babies\" for coming from a famous family? ",
        "url": "https://www.abc.net.au/news/2024-10-19/jack-schlossberg-and-the-nepo-babies-of-politics/104086622"
    },
    {
        "title": "Donald Trump's denial of the 2020 US presidential election result has shaped his 2024 campaign. Will he accept a loss this time?",
        "date": "Fri 18 Oct",
        "summary": "There's a lot to learn about the coming weeks from Donald Trump's response to the 2020 election result.",
        "url": "https://www.abc.net.au/news/2024-10-19/donald-trump-election-denial-2020-presidential-election-2024/104480676"
    },
    {
        "title": "Donald Trump has declared Republicans are the 'party of IVF' but two votes show it's more complex ",
        "date": "Sat 19 Oct",
        "summary": "Experts say that while Donald Trump and the Republican party say IVF treatments in the US are not at risk, signs are pointing otherwise.",
        "url": "https://www.abc.net.au/news/2024-10-20/donald-trump-and-ivf-republicans-complex-position/104489508"
    },
    {
        "title": "Donald Trump serves McDonald's fries in latest US election campaign appearance",
        "date": "Sun 20 Oct",
        "summary": "The former president worked the fries dispenser to deliver takeaway orders through a drive-through window.",
        "url": "https://www.abc.net.au/news/2024-10-21/donald-trump-serves-mcdonalds-fries-in-us-election/104496100"
    },
    {
        "title": "Elon Musk's $US1 million payouts to US voters raise election legality concerns",
        "date": "Sun 20 Oct",
        "summary": "The Tesla and SpaceX co-founder says he will make daily payments to people who sign his online petition in support of the US Constitution.",
        "url": "https://www.abc.net.au/news/2024-10-21/elon-musk-1-million-payouts-raise-us-election-legality-questions/104496446"
    },
    {
        "title": "Harris says Trump 'demeans' the presidency, Trump's McDonald's shift, and Stevie Wonder's serenade — the latest from the US election campaign trail",
        "date": "Mon 21 Oct",
        "summary": "Kamala Harris celebrates her 60th birthday with a day of campaigning as Donald Trump reveals details of a conversation with Benjamin Netanyahu — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-21/us-election-latest-wrap/104496566"
    },
    {
        "title": "Donald Trump sued by Central Park Five as Harris courts Republican voters — the latest from the US election campaign trail",
        "date": "Tue 22 Oct",
        "summary": "The Central Park Five announce they're suing Donald Trump for defamation and Kamala Harris courts the Republican vote — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-22/us-election-latest-wrap-oct-22/104500736"
    },
    {
        "title": "Could little-known presidential contender Jill Stein hand the election to Donald Trump?",
        "date": "Mon 21 Oct",
        "summary": "The Biden administration's staunch support of Israel was already threatening the Democrats' support from Arab-Americans in the key battleground state of Michigan, but for some in the community the escalating situation in Lebanon is the final straw.",
        "url": "https://www.abc.net.au/news/2024-10-22/us-election-trump-harris-jill-stein-green-party-michigan/104492754"
    },
    {
        "title": "Kamala Harris recruits more star power as Democrats seek celebrity boost in deadlocked US election race",
        "date": "Tue 22 Oct",
        "summary": "Kamala Harris is looking to her celebrity backers for a tie-breaking boost as the American presidential election campaign enters its final fortnight.",
        "url": "https://www.abc.net.au/news/2024-10-23/kamala-harris-us-presidential-election-campaign-celebrity/104505856"
    },
    {
        "title": "Snipers to protect voting stations, Donald Trump prepares for Joe Rogan appearance — the latest from the US election campaign trail",
        "date": "Wed 23 Oct",
        "summary": "Election security is ramping up, Donald Trump is preparing to sit down with Joe Rogan, and Rudy Giuliani is ordered to hand over his multi-million-dollar apartment — here's the latest updates from the US election.\n\n\n ",
        "url": "https://www.abc.net.au/news/2024-10-23/us-pols-election-latest-oct-23/104505804"
    },
    {
        "title": "Election officials fight conspiracy theories and Donald Trump's complaint against the UK Labour Party — the latest from the US election campaign trail",
        "date": "Thu 24 Oct",
        "summary": "Officials are fighting a resurgence in conspiracy theories as Donald Trump's campaign accuses the UK Labour Party of election interference — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-24/us-pols-election-latest-oct-24/104511602"
    },
    {
        "title": "Donald Trump meets the definition of a fascist, former White House chief of staff John Kelly says",
        "date": "Wed 23 Oct",
        "summary": "Donald Trump prefers the \"dictator approach\" to running a country, and openly wished he had \"Hitler's generals\" when he was US president, his former White House chief of staff says.",
        "url": "https://www.abc.net.au/news/2024-10-24/donald-trump-definition-fascist-john-kelly-us-election/104510430"
    },
    {
        "title": "This high-stakes meeting could pressure the Murdoch family to relinquish News Corp control",
        "date": "Fri 25 Oct",
        "summary": "As the Murdochs take their succession battle to court, industry insiders warn the end of the dynasty may be in sight.",
        "url": "https://www.abc.net.au/news/2024-10-26/news-corp-meeting-could-pressure-murdoch-to-relinquish-control/104478808"
    },
    {
        "title": "Beyoncé endorses Kamala Harris at Texas rally for US presidential candidate",
        "date": "Sat 26 Oct",
        "summary": "Music superstar Beyoncé throws her support behind Democratic presidential nominee Kamala Harris at a rally in Texas as Republican candidate Donald Trump also campaigns in the state.",
        "url": "https://www.abc.net.au/news/2024-10-26/beyonce-endorses-kamala-harris-houston-rally-texas/104522032"
    },
    {
        "title": "American voters on both sides hate their political system — so why does it keep getting worse?",
        "date": "Sat 26 Oct",
        "summary": "American voters on both sides hate the feedback loop that is creating more polarisation with each election. So why is change so elusive?",
        "url": "https://www.abc.net.au/news/2024-10-27/why-do-americans-hate-their-own-democracy/104517104"
    },
    {
        "title": "Live updates: Donald Trump calls for death penalty for 'any migrant who kills an American citizen' — as it happened",
        "date": "Sun 27 Oct",
        "summary": "Donald Trump addressed a rally at Madison Square Garden in New York while Kamala Harris spent the day campaigning \"neighbourhood-to-neighbourhood\" in Philadelphia. Look back on what happened with our live blog.",
        "url": "https://www.abc.net.au/news/2024-10-28/us-elections-live-blog-october-28/104519614"
    },
    {
        "title": "The world's richest man, Elon Musk, is determined to get Donald Trump elected. What does he have to gain?",
        "date": "Sun 27 Oct",
        "summary": "Elon Musk has promised to give away $US1 million a day leading up to the United States presidential election, but legal experts warn the move could open \"a new avenue for wealthy special interest money\" in American politics. ",
        "url": "https://www.abc.net.au/news/2024-10-28/elon-musk-spending-millions-to-get-donald-trump-elected/104513422"
    },
    {
        "title": "Trump's Madison Square Garden appearance takes aim at Harris, migrants, Puerto Rico — the latest from the US election campaign trail",
        "date": "Mon 28 Oct",
        "summary": "Donald Trump has headlined a rally at Madison Square Garden and a major newspaper is refusing to pick a winner — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-28/us-pols-election-latest-oct-28/104525332"
    },
    {
        "title": "In a tight US election, a gender split emerges as Donald Trump chases the 'bro vote'",
        "date": "Mon 28 Oct",
        "summary": "Donald Trump is working to get a notoriously unreliable voting bloc — young men — off the couch and into the polling booths. There's evidence his strategy is working.",
        "url": "https://www.abc.net.au/news/2024-10-29/us-presidential-election-gender-gap-trump-harris-vote/104507790"
    },
    {
        "title": "Barack Obama calls out 'bigoted' speakers at Donald Trump's New York rally as Kamala Harris promises to 'lift up' Americans  — as it happened",
        "date": "Mon 28 Oct",
        "summary": "Kamala Harris and Donald Trump have held duelling rallies in swing states, with the former president in Georgia and the vice-president in Michigan. Take a look back at Tuesday's events. ",
        "url": "https://www.abc.net.au/news/2024-10-29/trump-election-2024-abc-news-live-blog-october-harris/104527948"
    },
    {
        "title": "Elon Musk sued by Philadelphia DA over 'illegal' $US1 million daily giveaways",
        "date": "Tue 29 Oct",
        "summary": "It is the first legal action to be brought over the America PAC sweepstakes which offer $US1 million every day until November 5 for people who have signed a petition.",
        "url": "https://www.abc.net.au/news/2024-10-29/elon-musk-sued-over-million-dollar-giveaways/104531282"
    },
    {
        "title": "Trump campaign responds to Puerto Rico backlash as FBI investigates ballot box arson  — the latest from the US election campaign trail",
        "date": "Tue 29 Oct",
        "summary": "Donald Trump is facing serious backlash over comments made by opening speakers at his Madison Square Garden rally — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-29/us-pols-election-latest-oct-29/104531034"
    },
    {
        "title": "Pennsylvania's Northampton County voted for Obama, Trump and Biden. This time the election is dividing households",
        "date": "Tue 29 Oct",
        "summary": "Since 1912 the voters of Northampton County have only failed to correctly call the US election three times. They missed on Richard Nixon and George W Bush, twice. As Harris and Trump go head-to-head they are divided.",
        "url": "https://www.abc.net.au/news/2024-10-29/us-election-pennsylvania-swing-northampton-county-trump-harris/104526846"
    },
    {
        "title": "Inside the ground game in Pennsylvania, the US election's most critical battleground state",
        "date": "Tue 29 Oct",
        "summary": "With a week until election day, and a 0.2 per cent margin in the polls, the grassroots ground game in America's most high-stakes state is seeing some shifts in strategy.",
        "url": "https://www.abc.net.au/news/2024-10-30/us-election-trump-harris-pennsylvania-democrats-republicans/104531194"
    },
    {
        "title": "Kamala Harris delivers closing argument as Steve Bannon is released from prison — the latest from the US election campaign trail",
        "date": "Wed 30 Oct",
        "summary": "Kamala Harris delivers her closing speech at the same place Donald Trump held a rally with supporters who went on to attack the US Capitol in 2021, pledging to put \"country above party\". Here are the latest updates.",
        "url": "https://www.abc.net.au/news/2024-10-30/us-pols-election-latest-oct-30/104531362"
    },
    {
        "title": "US election: Harris admits 'this has not been a typical campaign' as Biden calls Trump supporters 'garbage' — as it happened",
        "date": "Tue 29 Oct",
        "summary": "Donald Trump says it was an \"honour to be involved\" in his New York rally, which he describes as \"an absolute love fest\". Look back on our blog. ",
        "url": "https://www.abc.net.au/news/2024-10-30/us-election-2024-trump-harris-october-30-as-it-happened/104533468"
    },
    {
        "title": "Kamala Harris 'strongly disagrees' with criticising people for their vote after Biden's 'garbage' comment",
        "date": "Wed 30 Oct",
        "summary": "Kamala Harris attempts to distance herself from Joe Biden's comments about Donald Trump's supporters, which have attracted backlash in the final days of the campaign.",
        "url": "https://www.abc.net.au/news/2024-10-31/us-election-harris-trump-biden-garbage/104540836"
    },
    {
        "title": "North Carolina is a swing state in this US election. Thousands of kilometres from the Mexico border immigrants and fentanyl are being made into one issue",
        "date": "Thu 31 Oct",
        "summary": "Fentanyl is a problem in North Carolina but is thousands of kilometres from the Mexico border. Despite that, a Republican blame game on both issues is a key election strategy.",
        "url": "https://www.abc.net.au/news/2024-10-31/fentanyl-and-immigrants-us-election-north-carolina/104543058"
    },
    {
        "title": "Donald Trump rides in a garbage truck as Pennsylvania faces multiple voting lawsuits — the latest from the US election campaign trail",
        "date": "Thu 31 Oct",
        "summary": "Kamala Harris attempts to distance herself from Joe Biden's \"garbage\" comments and an 18-year-old is charged after brandishing a machete at a Florida voting booth — here's the latest updates from the US election.",
        "url": "https://www.abc.net.au/news/2024-10-31/us-pols-election-latest-oct-31/104542410"
    },
    {
        "title": "US election: Donald Trump shows up in branded rubbish truck after Biden's 'garbage' followers remark — as it happened",
        "date": "Wed 30 Oct",
        "summary": "Donald Trump has jumped behind the wheel of a campaign-branded rubbish truck, criticising Joe Biden's comments about his \"garbage\" followers. ",
        "url": "https://www.abc.net.au/news/2024-10-31/us-election-live-blog-october-31/104539172"
    },
    {
        "title": "US election: Jennifer Lopez tells Kamala Harris rally in Las Vegas this is the 'most important stage' she has ever been on — as it happened",
        "date": "Thu 31 Oct",
        "summary": "Kamala Harris says Donald Trump's comment that he would protect women whether they \"like it or not\" shows the former president doesn't understand women's rights as she is joined by singer Jennifer Lopez in a late Las Vegas rally. ",
        "url": "https://www.abc.net.au/news/2024-11-01/us-election-blog-november-1/104547502"
    },
    {
        "title": "The US presidential election gets the headlines, but Americans will also vote in thousands of down ballot races for everything from judges to tax collectors",
        "date": "Thu 31 Oct",
        "summary": "Tens of millions of Americans will walk into a polling place on Tuesday to cast a vote for their preferred candidate for president. They'll also be asked to vote for members of congress, local prosecutors, sheriffs and tax collectors.",
        "url": "https://www.abc.net.au/news/2024-11-01/us-presidential-election-headlines-thousands-down-ballot-races/104541494"
    },
    {
        "title": "Billionaire Elon Musk a no-show in court over million-dollar giveaway set up to support Donald Trump",
        "date": "Thu 31 Oct",
        "summary": "Philadelphia's district attorney Larry Krasner, a Democrat, is trying to shut down the lottery being run by the America political action committee set up by Musk to support Donald Trump's election campaign.",
        "url": "https://www.abc.net.au/news/2024-11-01/elon-musk-million-dollar-giveaway-court-case/104547458"
    },
    {
        "title": "Donald Trump suggests Republican critic Liz Cheney wouldn't be a 'war hawk' if she had guns 'trained on her face'",
        "date": "Fri 1 Nov",
        "summary": "Donald Trump has suggested former GOP congresswoman Liz Cheney should be put in front of a line of rifles, as the Republican nominee's rhetoric draws increasing criticisms ahead of Tuesday's presidential election.",
        "url": "https://www.abc.net.au/news/2024-11-02/donald-trump-liz-cheney-violent-language/104552616"
    },
    {
        "title": "US election result could come down to swing voters in seven battleground states",
        "date": "Fri 1 Nov",
        "summary": "Voters in seven key battleground states look set to decide who becomes the next US president. This is a snapshot of what they're thinking on the eve of the election.",
        "url": "https://www.abc.net.au/news/2024-11-02/us-election-trump-harris-swing-state-voters/104162588"
    },
    {
        "title": "How Donald Trump got involved as key swing state counties certified the 2020 US presidential election results, and what it means for next week's 2024 vote",
        "date": "Fri 1 Nov",
        "summary": "What happened in Wayne County could play out again in key swing states this election. ",
        "url": "https://www.abc.net.au/news/2024-11-02/2020-election-and-precinct-committee-strategy/104534214"
    },
    {
        "title": "'Fight, fight' chants and raucous applause: Inside one of Donald Trump's last campaign rallies",
        "date": "Sun 3 Nov",
        "summary": "ABC's If You're Listening host Matt Bevan recounts what it was like to be among thousands of people to listen to one of Donald Trump's last campaign rallies in Macomb County, Michigan.",
        "url": "https://www.abc.net.au/news/2024-11-03/inside-a-donald-trump-campaign-rally-in-macomb-county-michigan/104554508"
    },
    {
        "title": "Kamala Harris makes surprise appearance on Saturday Night Live, urging US to 'keep calm-ala' days before election",
        "date": "Sun 3 Nov",
        "summary": "It was Kamala Harris's first time on the show, which has had other presidential candidates over its decades-long run.",
        "url": "https://www.abc.net.au/news/2024-11-03/kamala-harris-opens-saturday-night-live/104555444"
    },
    {
        "title": "Thousands join Women's March on Washington as US debates rights of women during presidential campaign",
        "date": "Sun 3 Nov",
        "summary": "A Women's March event in the US capital has brought thousands to the streets in support of Democratic presidential candidate Kamala Harris. ",
        "url": "https://www.abc.net.au/news/2024-11-03/womens-marches-held-ahead-of-us-presidential-election/104554398"
    },
    {
        "title": "Harris and Trump raid war chests hunting votes in final blitz of vital swing states in US election",
        "date": "Sat 2 Nov",
        "summary": "Kamala Harris and Donald Trump have been barnstorming the battleground states with private jets, sprawling ground games and war chests that need to be raided.  ",
        "url": "https://www.abc.net.au/news/2024-11-03/us-election-tracking-the-final-week-of-the-trump-harris-campaign/104550772"
    },
    {
        "title": "The one question from Donald Trump that could sway many American voters in swing states",
        "date": "Mon 4 Nov",
        "summary": "America's economy is booming but everyday life is much more expensive than it was four years ago — and that is the one question that's leading some voters to vote for Donald Trump. ",
        "url": "https://www.abc.net.au/news/2024-11-04/us-election-cost-of-living-wisconsin-donald-trump/104556710"
    },
    {
        "title": "US election 'oracle' predicts surprise Kamala Harris win in Iowa as Donald Trump rails at 'fake' poll",
        "date": "Sun 3 Nov",
        "summary": "A new poll from a pollster rated among country's most reputable predicts Kamala Harris will claim a surprise victory in Iowa — a state her rival Donald Trump had been expected to win easily — as the US presidential campaign enters its final stages.",
        "url": "https://www.abc.net.au/news/2024-11-04/donald-trump-criticises-poll-after-kamala-harris-prediction/104556162"
    },
    {
        "title": "Harris to campaign with Lady Gaga in Pennsylvania, as Trump says he 'shouldn't have left' the White House after 2020 election — as it happened",
        "date": "Sun 3 Nov",
        "summary": "Donald Trump takes aim at Kamala Harris and Joe Biden in his last rally of the day, while Barack Obama stumps for the vice-president in Wisconsin. Take a look back at our live blog.",
        "url": "https://www.abc.net.au/news/2024-11-04/us-election-live-updates-kamala-harris-donald-trump/104556190"
    },
    {
        "title": "From Harris to Trump to Clinton, these are the US politicians who have appeared on Saturday Night Live",
        "date": "Mon 4 Nov",
        "summary": "For 50 years, Saturday Night Live has been at the forefront of US political satire. Here are some of the politicians, presidents and White House hopefuls who have made an appearance.",
        "url": "https://www.abc.net.au/news/2024-11-04/snl-political-sketch-history-kamala-trump-obama-clinton-palin/104557566"
    },
    {
        "title": "Trump, tariffs and a big turn on climate: What the US election result might mean for Australia",
        "date": "Sun 3 Nov",
        "summary": "The US is Australia's most important military ally, one of our biggest trading partners and a critical diplomatic partner in the Indo-Pacific.",
        "url": "https://www.abc.net.au/news/2024-11-04/what-the-us-election-might-mean-for-australia/104554684"
    },
    {
        "title": "The US presidential election turnout could be affected by a 3,000km band of rainy and stormy weather",
        "date": "Tue 5 Nov",
        "summary": "The race to the White House this year between Donald Trump and Kamala Harris is a classic case where the atmosphere could be the decisive factor, with a band of heavy rain and thunderstorms forming from Texas to Canada, which is predicted to bring a swathe of severe weather during the next 48 hours over multiple states.",
        "url": "https://www.abc.net.au/news/2024-11-05/us-election-weather-voter-turnout-democrat-republican/104561534"
    },
    {
        "title": "Donald Trump and Kamala Harris go head-to-head on last day of campaign, as Trump threatens new Mexico tariff",
        "date": "Mon 4 Nov",
        "summary": "If there was any question about where the White House is likely to be won and lost, today's election-eve campaign blitz should provide the answer.",
        "url": "https://www.abc.net.au/news/2024-11-05/us-election-trump-kamala-final-day-of-campaign/104560524"
    },
    {
        "title": "How the swing states will decide the US election",
        "date": "Mon 4 Nov",
        "summary": "The presidential race is likely to be decided in a handful of states — but it would be foolish to rule out a surprise this time around.",
        "url": "https://www.abc.net.au/news/2024-11-05/us-election-states-polling-paths-to-victory/104557084"
    },
    {
        "title": "US election: First polls open after Trump and Harris deliver final pitches — as it happened ",
        "date": "Mon 4 Nov",
        "summary": "Millions of Americans are beginning to head to the polls to decide whether Kamala Harris or Donald Trump should win the race to the White House. ",
        "url": "https://www.abc.net.au/news/2024-11-05/us-election-live-updates-kamala-harris-donald-trump/104543126"
    },
    {
        "title": "Alt-right media, Secret Service and that orange vest. Explore the faces in the crowd at one of Trump's final rallies",
        "date": "Tue 5 Nov",
        "summary": "This hi-res panoramic image taken from the press pen at one of Donald Trump's final rallies before the election shows, in detail, just how much of a circus these events really are. ",
        "url": "https://www.abc.net.au/news/2024-11-05/trump-rally-faces-in-crowd-show-circus-in-action/104561070"
    },
    {
        "title": "Kamala Harris could make history, but she wouldn't be the first woman to lead a country",
        "date": "Mon 4 Nov",
        "summary": "The question about whether a woman can become the president of the United States has been asked time and again. Yet in other parts of the world, the question has already been answered with an emphatic \"yes\".",
        "url": "https://www.abc.net.au/news/2024-11-05/kamala-harris-could-follow-long-line-of-women-world-leaders/104559158"
    },
    {
        "title": "Explore the scale of Trump's triumph",
        "date": "Wed 6 Nov",
        "summary": "Use our interactive election map to explore just how big Donald Trump's victory might be in the end.",
        "url": "https://www.abc.net.au/news/2024-11-06/election-results-map-interactive/104557846"
    },
    {
        "title": "Australians join Americans to watch US election results unfold in Harris, Trump supporter parties ",
        "date": "Wed 6 Nov",
        "summary": "Attendees have gathered across Sydney for viewing parties to support Kamala Harris and Donald Trump as the US election results continue to unfold. ",
        "url": "https://www.abc.net.au/news/2024-11-06/us-election-watching-parties-results-kamala-harris-donald-trump/104568530"
    },
    {
        "title": "Donald Trump claims victory, Republicans take back the Senate and silence at Kamala Harris HQ: Key takeaways from US election",
        "date": "Wed 6 Nov",
        "summary": "Donald Trump has been elected president of the United States after flipping multiple swing states to secure the 270 electoral college votes needed to win. These were the key moments.",
        "url": "https://www.abc.net.au/news/2024-11-06/key-takeaways-from-the-us-election/104548166"
    },
    {
        "title": "US election voting drawing to a close in some states as contest between Donald Trump and Kamala Harris has capital on edge",
        "date": "Tue 5 Nov",
        "summary": "The United States capital is bracing for a rush of people onto its streets on Tuesday evening, with polling booths in some states beginning to close before early results start to trickle in. ",
        "url": "https://www.abc.net.au/news/2024-11-06/us-election-voting-between-donald-trump-kamala-harris-begins/104565092"
    },
    {
        "title": "US election 2024: Donald Trump promises 'bigger, better, bolder' America after securing stunning White House return — as it happened",
        "date": "Tue 5 Nov",
        "summary": "Donald Trump defeats his Democratic rival Kamala Harris in key battleground states and the popular vote, telling supporters America will be \"bigger, better, bolder\" in his second term in the White House. ",
        "url": "https://www.abc.net.au/news/2024-11-06/us-presidential-election-live-updates-kamala-harris-donald-trump/104546228"
    },
    {
        "title": "US election 2024 live results: Donald Trump defeats Kamala Harris, count continues in Arizona and Nevada",
        "date": "Tue 5 Nov",
        "summary": "Follow the results from the US presidential election as the count happens. Analyse the ABC News state map that shows what it takes to win the White House.",
        "url": "https://www.abc.net.au/news/2024-11-06/us-election-2024-live-results-electoral-map-who-has-won/104514296"
    },
    {
        "title": "Donald Trump leads Kamala Harris in all swing states as US presidential election counting continues",
        "date": "Wed 6 Nov",
        "summary": "Many analysts predict the election will go down to the wire, and be among the closest in the country's history.",
        "url": "https://www.abc.net.au/news/2024-11-06/us-election-results-donald-trump-kamala-harris/104565688"
    },
    {
        "title": "Donald Trump wins US presidential election for a second time ",
        "date": "Wed 6 Nov",
        "summary": "Donald Trump is only the second US president to win non-consecutive terms, following in the footsteps of Grover Cleveland, who won elections in 1884 and 1892. ",
        "url": "https://www.abc.net.au/news/2024-11-06/former-president-donald-trump-claims-us-presidential-election/104568024"
    },
    {
        "title": "Russia blamed for bomb threats at swing state polling locations as FBI warns of election-related falsehoods",
        "date": "Wed 6 Nov",
        "summary": "The FBI says Russian actors may have been behind dozens of false bomb threats targeting voting centres in swing states.",
        "url": "https://www.abc.net.au/news/2024-11-06/fbi-says-russia-made-bomb-threats-targeting-us-voting-centres/104567484"
    },
    {
        "title": "The night started with a party and a sense of promise but by midnight, the vibe had shifted",
        "date": "Wed 6 Nov",
        "summary": "As voting was closing across the United States and the count was getting underway, the streets around Howard University in Washington DC were buzzing. That feeling didn't last.",
        "url": "https://www.abc.net.au/news/2024-11-07/kamlala-harris-howard-university-party-over-as-trump-win-emerges/104569726"
    },
    {
        "title": "What a second Donald Trump presidency might mean for Australia",
        "date": "Wed 6 Nov",
        "summary": "Donald Trump will return to the White House, leaving allies like Australia — and rivals like China — wondering what might be coming next.",
        "url": "https://www.abc.net.au/news/2024-11-07/what-a-second-donald-trump-presidency-might-mean-for-australia/104569274"
    },
    {
        "title": "The bromance between Donald Trump and Elon Musk, the richest man in the world",
        "date": "Wed 6 Nov",
        "summary": "Trump has hailed his billionaire best friend as a \"new star\". But it certainly wasn't love at first sight. Was Musk really what Donald Trump needed to help him to take victory, and what role will he play in a Trump administration?",
        "url": "https://www.abc.net.au/news/2024-11-07/a-star-is-born-relationship-between-donald-trump-and-elon-musk/104569632"
    },
    {
        "title": "Donald Trump's 'beautiful' election map is back",
        "date": "Wed 6 Nov",
        "summary": "Donald Trump has won the US presidential election twice, and lost once. Take a look at how his results compare.",
        "url": "https://www.abc.net.au/news/2024-11-07/donald-trump-election-results-map-2016-2020-2024/104558542"
    },
    {
        "title": "While all eyes were on Trump and Harris, here are the other candidates with historic victories in the US election",
        "date": "Wed 6 Nov",
        "summary": "The winners of several congressional and senate races up and down the ballot have made historic firsts in the 2024 US election.",
        "url": "https://www.abc.net.au/news/2024-11-07/historic-firsts-us-election-2024-senate-congress/104569134"
    },
    {
        "title": "As Australia's powerhouse mining state reliant on China, here's how Donald Trump's victory could impact WA",
        "date": "Thu 7 Nov",
        "summary": "The return of Donald Trump to the White House sparks intense debate 15,000 kilometres away from the action inside Australia's economic powerhouse — a place so heavily reliant on mining, oil, gas and China.",
        "url": "https://www.abc.net.au/news/2024-11-07/western-australia-president-donald-trump-us-election-impact/104572618"
    },
    {
        "title": "When does Donald Trump get sworn in? Here's when he'll become US president",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump will return to the White House officially on January 20, 2025 on Inauguration day.",
        "url": "https://www.abc.net.au/news/2024-11-07/when-does-trump-become-president-explainer/104571630"
    },
    {
        "title": "The popular vote tells the story of Trump's victory, with inroads in most states and demographics",
        "date": "Thu 7 Nov",
        "summary": "American elections are ripe for information overload. With dozens of states and thousands of counties, the story of the night can be told and retold in endless ways.",
        "url": "https://www.abc.net.au/news/2024-11-07/trump-victory-by-the-numbers/104573034"
    },
    {
        "title": "Kamala Harris concedes US election to Donald Trump the day after he claims victory",
        "date": "Wed 6 Nov",
        "summary": "Democratic nominee Kamala Harris has conceded the election to Donald Trump, saying she respects the result but would not give up the fight that fuelled her campaign. ",
        "url": "https://www.abc.net.au/news/2024-11-07/kamala-harris-concedes-us-election-to-donald-trump/104570986"
    },
    {
        "title": "Donald Trump says he has 'powerful mandate' after Republicans' dominant US election showing",
        "date": "Wed 6 Nov",
        "summary": "Voters not only swept Donald Trump into the White House for a second time, but delivered his Republican Party a likely majority in the Senate and a possible one in the House at Tuesday's election. He also won the popular vote for the first time.",
        "url": "https://www.abc.net.au/news/2024-11-07/donald-trump-spruiks-mandate-as-republicans-dominate-us-election/104570428"
    },
    {
        "title": "Donald Trump is the first convicted felon to be president of the United States and his re-election could thwart further criminal cases against him",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump was facing a raft of legal battles before he was elected US president for a second time. Here's where each case stands and what his victory will likely mean for them.",
        "url": "https://www.abc.net.au/news/2024-11-07/donald-trump-could-evade-multiple-legal-battles/104572190"
    },
    {
        "title": "US election 2024 updates: Clintons urge Trump to govern 'for all of us' - as it happened",
        "date": "Wed 6 Nov",
        "summary": "Former US president Bill Clinton, former secretary of state Hillary Clinton and Watergate journalist Bob Woodward added their voices to those urging the incoming administration to govern with magnanimity. Take a look back at today's events. ",
        "url": "https://www.abc.net.au/news/2024-11-07/us-presidential-election-live-updates-kamala-harris-donald-trump/104570424"
    },
    {
        "title": "Donald Trump could change Russia-Ukraine war, challenge NATO and push defence spending across Europe",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump's election victory could reshape the trajectory of Russia's war in Ukraine, analysts say, while also making Europe's domestic defence spending more difficult and the handling of the Middle East war more complicated.",
        "url": "https://www.abc.net.au/news/2024-11-07/donald-trump-russia-ukraine-war-nato-defence-spending/104570192"
    },
    {
        "title": "Bob Woodward says Donald Trump will be governed by his instincts during a second term as US president",
        "date": "Thu 7 Nov",
        "summary": "Bob Woodward called Donald Trump \"unfit to lead the country\" but after surviving two assassination attempts he is hopeful the president-elect may have changed.",
        "url": "https://www.abc.net.au/news/2024-11-07/bob-woodward-speaks-on-donald-trump-presidency/104572758"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133276"
    },
    {
        "title": "Donald Trump's win is one for the history books. Here's how he pulled it off, through the eyes of two voters",
        "date": "Fri 8 Nov",
        "summary": "However you describe it, Donald Trump's election win will go down as a truly extraordinary moment in United States politics. As we try to understand exactly how he achieved it, conversations with two American voters sprung to mind. ",
        "url": "https://www.abc.net.au/news/2024-11-08/how-donald-trump-won-the-election/104576248"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133219"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133225"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133171"
    },
    {
        "title": "Who is Usha Vance, America's next second lady?",
        "date": "Fri 8 Nov",
        "summary": "The wife of JD Vance is the daughter of Indian immigrants who went to Yale law school and embodies many of the traits that would appear to rankle some of Trump's supporters.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-election-politics-who-is-usha-vance-americas-next-second-lady/104572134"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133266"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133212"
    },
    {
        "title": "US President Joe Biden pays tribute to Kamala Harris in first remarks since Donald Trump's election win",
        "date": "Thu 7 Nov",
        "summary": "US President Joe Biden has called for Americans to \"bring down the temperature\" of political debate in his first speech since Donald Trump's comprehensive win in Tuesday's election. ",
        "url": "https://www.abc.net.au/news/2024-11-08/biden-speaks-after-harris-us-election-loss-to-trump/104575622"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133283"
    },
    {
        "title": "Donald Trump claims to have a 'powerful' mandate for his second presidency. These are his policies",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump will return to the White House with what he calls a \"powerful mandate\". Here's a look at the policies he's put forward. ",
        "url": "https://www.abc.net.au/news/2024-11-08/donald-trump-second-presidency-term-policies/104573310"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133290"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133291"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133199"
    },
    {
        "title": "Federal Reserve chairman Jerome Powell defies Trump on day one",
        "date": "Fri 8 Nov",
        "summary": "The Federal Reserve sets US interest rates and manages monetary policy, and its chair, Jerome Powell, has declared he won't be stepping down until his term ends in 2026.",
        "url": "https://www.abc.net.au/news/2024-11-08/verrender-jerome-powell-defies-trump-on-day-one/104577582"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133288"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133272"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133287"
    },
    {
        "title": " Following the US election result, new fronts for false election fraud claims have opened online",
        "date": "Thu 7 Nov",
        "summary": "As celebrations and commiserations followed the US election result, claims about election fraud germinated online, but this time it wasn't just from Trump supporters.",
        "url": "https://www.abc.net.au/news/2024-11-08/democrat-election-conspiracy-theories/104573550"
    },
    {
        "title": "Kevin Rudd called Donald Trump 'traitor'. Trump says Rudd is 'nasty'. Can the US ambassador survive a Trump presidency?",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump thinks Kevin Rudd is \"a little bit nasty\" and \"not the brightest bulb\". It is an open question whether Australia's ambassador to America will be able to deal with the returning Trump administration.",
        "url": "https://www.abc.net.au/news/2024-11-08/rudd-trump-us-ambassador-question/104574464"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133261"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133285"
    },
    {
        "title": "These Latino and Black voters were once Democrats, but Donald Trump changed everything",
        "date": "Thu 7 Nov",
        "summary": "Democrats were once able to count on their popularity among multiple racial demographics in the US, but some in these groups — including Latinos and Black men — are turning their backs on the party. This is why.",
        "url": "https://www.abc.net.au/news/2024-11-08/these-voters-were-once-democrats-but-trump-changed-everything/104575626"
    },
    {
        "title": "US election 2024: Donald Trump appoints Susie Wiles chief of staff, as US public servants brace for purge — as it happened",
        "date": "Thu 7 Nov",
        "summary": "Donald Trump has announced his White house chief of staff will be Susan Summerall Wiles, a co-chair of his campaign. Follow live.",
        "url": "https://www.abc.net.au/news/2024-11-08/us-presidential-election-live-updates-joe-biden-donald-trump/104575438#live-blog-post-133155"
    },
    {
        "title": "Donald Trump wins Nevada, putting him over 300 electoral votes and leaving Arizona as the last state to be called",
        "date": "9h ago",
        "summary": "Arizona, with its 11 Electoral College votes, is now the last state to be called — and Donald Trump holds a lead there too.",
        "url": "https://www.abc.net.au/news/2024-11-09/2024-presidential-election-result-nevada-associated-press-trump/104581836"
    },
    {
        "title": "Susie Wiles will be Donald Trump's chief of staff. Who is the so-called 'ice maiden'?",
        "date": "12h ago",
        "summary": "US president-elect Donald Trump has appointed his campaign lead Susie Wiles as his incoming chief of staff, who he has called an \"ice maiden\". This is what we know about Ms Wiles. ",
        "url": "https://www.abc.net.au/news/2024-11-09/susie-wiles-trump-next-chief-of-staff/104581102"
    },
    {
        "title": "Australia's election campaign won't be fought like America's. But it will still lack the policy rigour and ambition of years gone by",
        "date": "19h ago",
        "summary": "Australia's election campaign will not be fought in the way the US race was fought: as a battle between rage or joy. But we should despair that it will feature little of the policy rigour or ambition that economists like Geoff Carmody brought to battles gone by. \n\n ",
        "url": "https://www.abc.net.au/news/2024-11-09/australia-election-us-campaign-trump-policy-rigour/104576522"
    },
    {
        "title": "Abortion rights were also on the agenda in the US election. Here's what happened",
        "date": "18h ago",
        "summary": "Abortion and reproductive rights have been a divisive issue in the United States since Roe v Wade was overturned by the Supreme Court in 2022 and figured heavily in the election campaign.",
        "url": "https://www.abc.net.au/news/2024-11-09/us-election-abortion-rights-on-ballots-in-new-york-arizona-other/104570072"
    },
    {
        "title": "Man charged over alleged Iranian plot to assassinate Donald Trump",
        "date": "20h ago",
        "summary": "The US Department of Justice says it has charged 51-year-old Farhad Shakeri, alleging Iranian authorities had tasked him with preparing hits on Israeli and American citizens, including the president-elect.",
        "url": "https://www.abc.net.au/news/2024-11-09/man-charged-over-alleged-iranian-plot-to-kill-donald-trump/104580850"
    },
    {
        "title": "Kalgoorlie miners hope Donald Trump's election win will boost gold prices",
        "date": "16h ago",
        "summary": "Australia's gold miners have been the beneficiary of an historic run in the gold price during the lead-up to the US presidential election.",
        "url": "https://www.abc.net.au/news/2024-11-09/us-election-trump-victory-impact-on-aussie-dollar-gold-price/104569046"
    },
    {
        "title": "Donald Trump vows to undo climate change policy, but he will struggle to halt progress",
        "date": "19h ago",
        "summary": "Donald Trump has called climate change a hoax, a scam, and has promised to roll back environmental protections and withdraw from international climate action. But unpicking climate policies could be at his peril.",
        "url": "https://www.abc.net.au/news/2024-11-09/trump-cant-stop-climate-progress/104572296"
    },
    {
        "title": "Trump's behaviour doesn't scream 'blessed are the meek'. But once again, Christian voters helped him win the White House",
        "date": "19h ago",
        "summary": "As we crunch data and pore over the exit polls to try to get an understanding of the way America voted, along with the economy and immigration, religion must also be understood as a decisive factor delivering victory to the Republicans.",
        "url": "https://www.abc.net.au/news/2024-11-09/trump-president-christian-voters-helped-win-white-house/104576592"
    },
    {
        "title": "What Pennsylvania taught me about Donald Trump voters",
        "date": "18h ago",
        "summary": "If you've ever seen a Trump rally and paid attention to the crowd behind him, you might think you know what his typical voter looks like. Spend some time in swing state Pennsylvania, and your impressions might change.",
        "url": "https://www.abc.net.au/news/2024-11-09/pennsylvania-trump-voters/104580706"
    },
    {
        "title": "Sport",
        "date": "Mon, 4 Nov",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/cricket"
    },
    {
        "title": "Local",
        "date": "无日期",
        "summary": "The ABC has more than 50 newsrooms producing local live news and local radio coverage of regional Australia, cities and communities across Australia. Find your local ABC website covering your local community.",
        "url": "https://www.abc.net.au/local"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/more"
    },
    {
        "title": "Laura Tingle",
        "date": "19h ago",
        "summary": "无摘要",
        "url": "https://www.abc.net.au/news/laura-tingle/9711054"
    },
    {
        "title": "Contact ABC News",
        "date": "无日期",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/contact"
    },
    {
        "title": "Fact Check",
        "date": "Sun 21 May",
        "summary": "ABC Fact Check determines the accuracy of claims by politicians, public figures, advocacy groups and institutions engaged in the public debate",
        "url": "https://www.abc.net.au/news/factcheck"
    },
    {
        "title": "Gold",
        "date": "Sat 7 Sep",
        "summary": "Browse stories related to Gold",
        "url": "https://www.abc.net.au/news/topic/gold"
    },
    {
        "title": "Planet America",
        "date": "无日期",
        "summary": "Chas Licciardello and John Barron guide you through the issues and events of the week in America as President Joe Biden completes his final weeks in the White House before Donald Trump makes a comeback as the 47th President.",
        "url": "https://iview.abc.net.au/show/planet-america"
    },
    {
        "title": "Tok Pisin",
        "date": "Yesterday at 4:59am",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/tok-pisin"
    },
    {
        "title": "Sport",
        "date": "Mon, 4 Nov",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/hc/en-us/articles/360001548096-ABC-Terms-of-Use"
    },
    {
        "title": "Analysis & Opinion",
        "date": "11h ago",
        "summary": "Stay up to date with the top Australian analysis & opinion, and commetary news",
        "url": "https://www.abc.net.au/news/analysis-and-opinion"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment#anchor-102956242"
    },
    {
        "title": "About the ABC",
        "date": "Wed",
        "summary": "Information about the Australian Broadcasting Corporation including history, management, corporate reports, plans and submissions and the latest news from our media centre.",
        "url": "https://www.abc.net.au/about/"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://discover.abc.net.au/index.html?siteTitle=news"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment#anchor-102956258"
    },
    {
        "title": "National Security",
        "date": "Thu 19 Sep",
        "summary": "Browse stories related to National Security",
        "url": "https://www.abc.net.au/news/topic/national-security"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/hc/en-us/articles/360001154976-ABC-Privacy-Policy"
    },
    {
        "title": "US Election 2024 - Latest News & Live Coverage on ABC News",
        "date": "Yesterday, 8:48am",
        "summary": "Follow the latest news from the 2024 US presidential election including live coverage and analysis from ABC News experts.",
        "url": "https://www.abc.net.au/news/us-election"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "395K Followers, 2,368 Following, 11K Posts - ABC Australia (@abcaustralia) on Instagram: \"We are a feel-good community that celebrates the people, places and wildlife of Australia 👋🥰🐦 \n📸 Share your photos using #ABCMyPhoto\"",
        "url": "https://www.instagram.com/abcaustralia/"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "Welcome to the official ABC News channel. As well as our 24-hour live stream, we also livestream breaking news events (make sure you subscribe and tap the be...",
        "url": "https://www.youtube.com/@abcnewsaustralia"
    },
    {
        "title": "Politics",
        "date": "Yesterday at 7:17am",
        "summary": "Australian politics, policy analysis, explainers, election coverage and more",
        "url": "https://www.abc.net.au/news/politics"
    },
    {
        "title": "Welcome to ABC iview",
        "date": "49m ",
        "summary": "Watch all your favourite ABC programs on ABC iview. The best of ABC dramas, documentaries, comedies and ABC News programs for Australia's most trusted source of local, national and world news.",
        "url": "https://iview.abc.net.au"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment#anchor-103048170"
    },
    {
        "title": "ABC Home",
        "date": "Saturday 9 November 2024",
        "summary": "Your home of Australian stories, conversations and events that shape our nation.",
        "url": "https://www.abc.net.au#top"
    },
    {
        "title": "Courts and Trials",
        "date": "Yesterday at 7:17am",
        "summary": "Browse stories related to Courts and Trials",
        "url": "https://www.abc.net.au/news/topic/courts-and-trials"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "Welcome to the official ABC News channel. As well as our 24-hour live stream, we also livestream breaking news events (make sure you subscribe and tap the be...",
        "url": "https://www.youtube.com/user/newsonabc"
    },
    {
        "title": "ABC Home",
        "date": "Saturday 9 November 2024",
        "summary": "Your home of Australian stories, conversations and events that shape our nation.",
        "url": "https://www.abc.net.au"
    },
    {
        "title": "Central Banks",
        "date": "无日期",
        "summary": "Browse stories related to Central Banks",
        "url": "https://www.abc.net.au/news/topic/central-banks"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "1M Followers, 221 Following, 27K Posts - ABC News (@abcnews_au) on Instagram: \"News that you actually want to have in your feed \n📰 Read more \n📲 Download our app \n👇🏻 Sign up to our newsletter\"",
        "url": "https://www.instagram.com/abcnews_au/"
    },
    {
        "title": "ABC News",
        "date": "56s",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/"
    },
    {
        "title": "ABC Kids",
        "date": "无日期",
        "summary": "ABC Kids is home to trusted and loved preschool programs. Learn, play and explore with our games, apps, songs, clips, print and colour, craft and more.",
        "url": "https://www.abc.net.au/abckids"
    },
    {
        "title": "Business",
        "date": "9h ago",
        "summary": "News from the world of finance and business. Top stories in text, video and audio. Business video news bulletin. Features and analysis.",
        "url": "https://www.abc.net.au/news/business"
    },
    {
        "title": "ABC Home",
        "date": "Saturday 9 November 2024",
        "summary": "Your home of Australian stories, conversations and events that shape our nation.",
        "url": "https://www.abc.net.au#content"
    },
    {
        "title": "Sport",
        "date": "16h ago",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/football"
    },
    {
        "title": "Federal Government",
        "date": "Thu 7 Nov",
        "summary": "Browse stories related to Federal Government",
        "url": "https://www.abc.net.au/news/topic/federal-government"
    },
    {
        "title": "News Channel",
        "date": "15m ",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/newschannel"
    },
    {
        "title": "Law, Crime and Justice",
        "date": "1m 11s",
        "summary": "Browse stories related to Law, Crime and Justice",
        "url": "https://www.abc.net.au/news/topic/law-crime-and-justice"
    },
    {
        "title": "Sport",
        "date": "Wed 30 Oct",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/netball"
    },
    {
        "title": "ABC Editorial Policies",
        "date": "无日期",
        "summary": "The ABC sets high standards for the quality of its content, and the information on this site will help you maintain those standards.",
        "url": "https://www.abc.net.au/edpols"
    },
    {
        "title": "Sport",
        "date": "Thu, 5 Sept",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/afl"
    },
    {
        "title": "Rural",
        "date": "7m ",
        "summary": "ABC Rural News provides authoritative coverage of the business and politics of Australian farming, livestock, forestry, agriculture and primary production",
        "url": "https://www.abc.net.au/news/rural"
    },
    {
        "title": "",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://policies.google.com/terms"
    },
    {
        "title": "Sport",
        "date": "Thu 7 Nov",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/tennis"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment#anchor-102956246"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "Each day, ABC Australia, brings you stories about the people, places, wildlife and issues that make up our country. We bring you stories, conversations, expl...",
        "url": "https://www.youtube.com/abcaustralia"
    },
    {
        "title": "Find alerts in your area",
        "date": "无日期",
        "summary": "Up to date information about bushfires, storms, flooding and other emergencies from around Australia, along with advice to protect you and your property.",
        "url": "https://www.abc.net.au/news/emergency"
    },
    {
        "title": "Berita dalam Bahasa Indonesia",
        "date": "Yesterday at 9:31am",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/indonesian"
    },
    {
        "title": "Media Industry",
        "date": "Fri 25 Oct",
        "summary": "Browse stories related to Media Industry",
        "url": "https://www.abc.net.au/news/topic/media-industry"
    },
    {
        "title": "ABC Elections",
        "date": "Wed 2 Oct",
        "summary": "Extensive coverage of federal, state and local elections by the ABC. Election guides by ABC election analyst Antony Green, results, statistics, news and more.",
        "url": "https://www.abc.net.au/news/elections"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle#anchor-102961872"
    },
    {
        "title": "Social Media",
        "date": "Thu 7 Nov",
        "summary": "Browse stories related to Social Media",
        "url": "https://www.abc.net.au/news/topic/social-media"
    },
    {
        "title": "World News",
        "date": "40m ago",
        "summary": "The latest World News headlines, photos, video and audio content from the ABC's trusted network of overseas-based journalists.",
        "url": "https://www.abc.net.au/news/world"
    },
    {
        "title": "USA VOTES",
        "date": "19m ",
        "summary": "Get the latest USA election news coverage, live stream video and analysis from ABC NEWS on ABC iview.",
        "url": "https://iview.abc.net.au/category/usa-votes"
    },
    {
        "title": "Foreign Affairs",
        "date": "Wed 6 Nov",
        "summary": "Browse stories related to Foreign Affairs",
        "url": "https://www.abc.net.au/news/topic/foreign-affairs"
    },
    {
        "title": "America, Are You Ok?",
        "date": "无日期",
        "summary": "Australians watch how the US do democracy with a mixture of confusion and surprise. Why does no one seem satisfied with how government works? Casey Briggs examines a democracy that many people have deep reservations about.",
        "url": "https://iview.abc.net.au/show/america-are-you-ok"
    },
    {
        "title": "ABC Backstory",
        "date": "Thu 15 Aug",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/backstory"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/hc/en-us/articles/360001548096-ABC-Terms-of-Use#Use_of_ABC_Content"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://x.com/abcnews"
    },
    {
        "title": "ABC中文",
        "date": "Tue 5 Nov",
        "summary": "澳大利亚广播公司ABC独立于政府、政治团体，商业或其他行业机构，不涉及任何利益关系，编辑自主，提供客观和公正的新闻报道，是澳大利亚全国公共广播机构。ABC中文遵循ABC编辑方针，以澳大利亚视角，报道国内外重大新闻事件、深度分析时事要闻、多方展现观点碰撞。",
        "url": "https://www.abc.net.au/news/chinese"
    },
    {
        "title": "Environment",
        "date": "11h ago",
        "summary": "Stay up to date with the top Australian environment news, industry information, and breaking news",
        "url": "https://www.abc.net.au/news/environment"
    },
    {
        "title": "triple j",
        "date": "3m ",
        "summary": "We love music. triple j is the place for the best new music from around Australia & the world. Listen via radio or stream online.",
        "url": "https://www.abc.net.au/triplej"
    },
    {
        "title": "Indigenous News",
        "date": "9h ago",
        "summary": "Coverage of issues and news relating to Aboriginal and Indigenous Australians from ABC News",
        "url": "https://www.abc.net.au/news/indigenous"
    },
    {
        "title": "This channel is only available in Apple News.",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://apple.news/TsieN9U-WQ0SZbtP1VTI4uQ"
    },
    {
        "title": "Science",
        "date": "11h ago",
        "summary": "Stay up to date with the top Australian science news, and industry information.",
        "url": "https://www.abc.net.au/news/science"
    },
    {
        "title": "ABC Accessibility Statement",
        "date": "26 May 2024",
        "summary": "We are committed to making our websites and mobile applications usable by all people, whatever their abilities or disabilities. To achieve this we strive to comply with the W3C's Web Content Accessibility Guidelines (WCAG) 2.2.",
        "url": "https://www.abc.net.au/about/accessibility-statement/103700726"
    },
    {
        "title": "Stay in the know",
        "date": "无日期",
        "summary": "Follow the latest news headlines from Australia's most trusted source. Read in-depth expert analysis and watch live coverage on ABC News.",
        "url": "https://www.abc.net.au/news/subscribe"
    },
    {
        "title": "If You're Listening",
        "date": "无日期",
        "summary": "The world is on fire. Inflation is through the roof, and AI is taking our jobs. What does it all mean? Matt Bevan explains the biggest story in world news while hiding in his basement from assassins and authoritarian regimes.",
        "url": "https://iview.abc.net.au/show/if-you-re-listening/"
    },
    {
        "title": "Shootings",
        "date": "Wed 9 Oct",
        "summary": "Browse stories related to Shootings",
        "url": "https://www.abc.net.au/news/topic/shootings"
    },
    {
        "title": "ABC listen",
        "date": "55m ",
        "summary": "Listen - anywhere, anytime. Your personal audio companion.",
        "url": "https://www.abc.net.au/listen"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle#anchor-102961870"
    },
    {
        "title": "Terrorism",
        "date": "Tue 29 Oct",
        "summary": "Browse stories related to Terrorism",
        "url": "https://www.abc.net.au/news/topic/terrorism"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle#anchor-102961862"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "ABC News. 4,198,437 個讚好 · 61,148 人正在談論這個 · 3,897 次簽到. News and analysis from Australia’s most trusted news organisation.",
        "url": "https://www.facebook.com/abcnews.au/"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://twitter.com/abcaustralia/"
    },
    {
        "title": "US Election 2024 - Latest News & Live Coverage on ABC News",
        "date": "Yesterday, 8:48am",
        "summary": "Follow the latest news from the 2024 US presidential election including live coverage and analysis from ABC News experts.",
        "url": "https://www.abc.net.au/news/topic/us-elections"
    },
    {
        "title": "ABC Investigations",
        "date": "44m ",
        "summary": "ABC Investigations",
        "url": "https://www.abc.net.au/news/story-streams/investigations"
    },
    {
        "title": "ABC Home",
        "date": "Saturday 9 November 2024",
        "summary": "Your home of Australian stories, conversations and events that shape our nation.",
        "url": "https://www.abc.net.au#sidebar"
    },
    {
        "title": "Just In",
        "date": "40m ago",
        "summary": "Live breaking news stories from across Australia & around the world. In-depth coverage from Australia's most trusted source. Includes business, sport, weather.",
        "url": "https://www.abc.net.au/news/justin"
    },
    {
        "title": "Julia Baird",
        "date": "19h ago",
        "summary": "无摘要",
        "url": "https://www.abc.net.au/news/julia-baird/4512348"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/hc/en-us/articles/360001511015"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment"
    },
    {
        "title": "For You",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://www.abc.net.au/news/for-you"
    },
    {
        "title": "Ian Verrender",
        "date": "Yesterday at 4:30am",
        "summary": "无摘要",
        "url": "https://www.abc.net.au/news/ian-verrender/5261264"
    },
    {
        "title": "",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://policies.google.com/privacy"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "ABC Australia， 悉尼. 922,063 個讚好 · 3,488 人正在談論這個 · 13,441 次簽到. Official account of the Australian Broadcasting Corporation.",
        "url": "https://www.facebook.com/abc/"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://twitter.com/abcnews/"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle#anchor-102961868"
    },
    {
        "title": "Lifestyle",
        "date": "无日期",
        "summary": "Discover the latest trends in Lifestyle. Find expert insights on wellbeing, family, relationships, food, recipes, home ideas, and gardening at ABC News.",
        "url": "https://www.abc.net.au/news/lifestyle#anchor-102961866"
    },
    {
        "title": "Crime",
        "date": "6m ",
        "summary": "Browse stories related to Crime",
        "url": "https://www.abc.net.au/news/topic/crime"
    },
    {
        "title": "Entertainment & Culture",
        "date": "无日期",
        "summary": "Stay up to date with ABC's latest entertainment updates, delivering breaking news and trending scoops on TV shows, movies, books, music, pop culture, and art.",
        "url": "https://www.abc.net.au/news/entertainment#anchor-102956248"
    },
    {
        "title": "History",
        "date": "Tue 5 Nov",
        "summary": "Browse stories related to History",
        "url": "https://www.abc.net.au/news/topic/history"
    },
    {
        "title": "Health",
        "date": "1h ago",
        "summary": "The latest health news from Australia and around the world, as well as tips and information to help you improve your health and wellbeing.",
        "url": "https://www.abc.net.au/news/health"
    },
    {
        "title": "无标题",
        "date": "无日期",
        "summary": "无摘要",
        "url": "https://help.abc.net.au/hc/en-us/articles/360001150496-What-are-the-contact-details-for-the-ABC-"
    },
    {
        "title": "World Politics",
        "date": "20h ago",
        "summary": "Browse stories related to World Politics",
        "url": "https://www.abc.net.au/news/topic/world-politics"
    },
    {
        "title": "Sport",
        "date": "Fri, 13 Sept",
        "summary": "Sport news, live scores, features, analysis and photos from the world of sport. Comprehensive coverage of AFL, cricket, football, rugby league and rugby union. Audio interviews. News stories and highlights in video. Sports news bulletin.",
        "url": "https://www.abc.net.au/news/sport/rugbyleague"
    }
]